[
  {
    "id": "hindu-1",
    "text": "China launches probes targeting U.S. semiconductors ahead of Madrid trade talks. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 14, 2025 11:13 am IST - Taipei U.S. measures such as export curbs and tariffs “constitute the containment and suppression of China’s development of high-tech industries” such as advanced computer chips and artificial intelligence.\n                                          | Photo Credit: Getty Images/iStockphoto China launched two probes targeting the U.S. semiconductor sector on Saturday (September 13, 2025) ahead of talks between the two nations in Spain this week on trade, national security and the ownership of social media platform TikTok. China's Ministry of Commerce announced an anti-dumping investigation into certain analog IC chips imported from the U.S. The investigation will target some commodity interface IC chips and gate driver IC chips, which are commonly made by U.S. companies such as Texas Instruments and ON Semiconductor. The Ministry separately announced an anti-discrimination probe into U.S. measures against China's chip sector. U.S. Treasury Secretary Scott Bessent is set to meet Chinese Vice Premier He Lifeng in Madrid between Sunday and Wednesday, He's office said. U.S. measures such as export curbs and tariffs “constitute the containment and suppression of China's development of high-tech industries” such as advanced computer chips and artificial intelligence, a Chinese commerce ministry spokesperson said. The announcements of the probes follow the U.S. on Friday adding 23 Chinese companies to an “entity list” of businesses that will face restrictions for allegedly acting against U.S. national security and foreign policy interests. The list includes two Chinese companies accused of acquiring chipmaking equipment for major Chinese chipmaker SMIC. The meetings between Bessent and He in Madrid will be the latest in a series of negotiations aimed at reducing trade tensions and postponing the enactment of higher tariffs on each other's goods. U.S. and Chinese counterparts previously held discussions in Geneva in May, London in June and Stockholm in July. The two governments have agreed to several 90-day pauses on a series of increasing reciprocal tariffs, staving off an all-out trade war. Mr. Bessent described the talks during the last round in Stockholm as \"very fulsome.\"  “We just need to de-risk with certain, strategic industries, whether it's the rare earths, semiconductors, medicines, and we talked about what we could do together to get into balance within the relationship,” Mr. Bessent said at the time. U.S. President Donald Trump and former President Joe Biden placed curbs on China's access to advanced semiconductors including restrictions on the sale of chipmaking equipment to the country. While Washington cites national security concerns, China argues the curbs are part of a U.S. strategy to contain its growth. Published - September 14, 2025 10:51 am IST China\n                    \n                            /                      \n                        \n                        USA Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-2",
    "text": "U.S., Chinese officials to launch talks in Spain on trade irritants, TikTok deadline. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 14, 2025 11:14 am IST - MADRID U.S. Secretary of the Treasury Scott Bessent, U.S. Trade Representative Jamieson Greer, China’s International Trade Representative and Vice Minister of Commerce Li Chenggang, and Chinese Vice Premier He Lifeng, prepare to discuss on the day of a bilateral meeting between the U.S. and China. \n                                          | Photo Credit: Reuters U.S. and Chinese officials meet in Madrid on Sunday (September 14, 2025) to hash over longstanding trade irritants, a looming divestiture deadline for Chinese short video app TikTok and demands by Washington that G7 and European allies impose tariffs on China to halt its purchases of Russian oil. The talks in the Spanish capital mark the fourth time in four months that U.S. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson Greer have met with Chinese Vice Premier He Lifeng in European cities to try to keep a fractured U.S.-China trade relationship from collapsing under President Donald Trump's tariffs. The three officials, along with China's top trade negotiator, Li Chenggang, last met in Stockholm in July where they agreed in principle to extend for 90 days a trade truce that sharply reduced triple-digit retaliatory tariffs on both sides and restarted the flow of rare-earth minerals from China to the United States. Mr. Trump has approved the extension of current U.S. tariff rates on Chinese goods, totalling about 55%, until November 10. Trade experts said there was little likelihood of a substantial breakthrough in the talks hosted by Spain's Socialist Prime Minister Pedro Sanchez, who has sought to improve ties with Beijing in recent years. The most likely result of the Madrid talks is seen as another extension of a deadline for the popular TikTok app's Chinese owner, ByteDance, to divest its U.S. operations by September 17 or face a U.S. shutdown. A source familiar with the Trump administration's discussions on TikTok's future said that a deal was not expected, but that the deadline would be extended for a fourth time since Trump took office in January. Mr. Trump last month launched a TikTok account. TikTok has not been discussed in previous rounds of U.S.-China trade talks in Geneva, London and Stockholm. But the source said the issue's public inclusion as an agenda item on the Treasury's announcement of the talks gives the Trump administration political cover for another extension, which may annoy both Republicans and Democrats in Congress who mandated TikTok's sale to a U.S. entity to reduce national security risks. Wendy Cutler, a former USTR trade negotiator and head of the Asia Society Policy Institute in Washington, said she expected more substantial \"deliverables\" to be saved for a potential meeting between Mr. Trump and Chinese president Xi Jinping later this year, perhaps at an Asia Pacific Economic Cooperation summit in Seoul at the end of October. These may include a final deal to resolve U.S. national security concerns over TikTok, and a lifting of restrictions on Chinese purchases of American soybeans and reduction of fentanyl-related tariffs on Chinese goods, and the Madrid discussions may help lay groundwork for such a meeting, Ms. Cutler said. But she said resolving core U.S. economic complaints about China, including its demands that China shift its economic model toward more domestic consumption and rely less on state-subsidized exports, could take years. \"Frankly, I don't think China is in any rush to do an agreement where they don't get substantial concessions on export controls and lower tariffs, which are their key priorities,\" Ms. Cutler said. \"And I don't see the United States in a position to make major concessions on either, unless there's some breakthrough on its demands to China.\" The Treasury has said the Madrid talks also would cover joint U.S.-Chinese efforts to combat money laundering, a reference to its longstanding demands that China clamp down on illicit shipments of technology goods to Russia that aid its war in Ukraine. Mr. Bessent urged Group of Seven allies on Friday to impose \"meaningful tariffs\" on imports from China and India to pressure them to stop buying Russian oil, a move aimed at bringing Moscow into Ukraine peace negotiations by curbing its oil revenues. The G7 Finance Ministers said on Friday they discussed such measures and agreed to speed up discussions to use frozen Russian assets to aid Ukraine's defence. Mr. Bessent and Mr. Greer said in a separate statement that G7 allies should join the United States in imposing tariffs on buyers of Russian oil. \"Only with a unified effort that cuts off the revenues funding Putin's war machine at the source will we be able to apply sufficient economic pressure to end the senseless killing,\" Mr. Bessent and Mr. Greer said, referring to Russian President Vladimir Putin. The U.S. has imposed an extra 25% tariff on Indian goods over the country's purchases of Russian oil, but has so far refrained from imposing such punitive duties on Chinese goods. China's Ministry of Commerce has said the Madrid talks will cover economic and trade issues such as U.S. tariffs, the \"abuse\" of export controls and TikTok. The Spanish government is seeking maximum exposure for the talks. Spanish Foreign Minister José Manuel Albares will publicly greet the two delegations before the start of the talks at 1:50 p.m. local time at the baroque Palacio de Santa Cruz, which houses Spain's Foreign Ministry. A Spanish government source said the choice of Spain for the latest round of the \"delicate\" talks was evidence that Madrid was consolidating itself as a seat of high-level and strategic negotiations. Madrid has sought to be a venue for an international peace conference to resolve the Israel-Palestinian conflict. The source said Spain's government also takes advantage of the event to reinforce its own bilateral relations with the U.S. following a series of tense engagements with the Trump administration over its criticism of Israel's offensive in Gaza, and its refusal to commit to spending 5% of its budget on defence along with other NATO members. Mr. Bessent himself has also criticised Mr. Sanchez for declaring Beijing a \"strategic partner\" at the height of Mr. Trump's tariff offensive in April, saying that a closer relationship with the Asian giant was akin to \"cutting your own throat\". Published - September 14, 2025 10:32 am IST USA\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        trade dispute\n                    \n                            /                      \n                        \n                        Spain\n                    \n                            /                      \n                        \n                        technology (general) Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-3",
    "text": "London anti-immigrant protest organised by far-right activist results in clashes with police. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 14, 2025 11:03 am IST - London Police officers clash with supporters of British anti-immigration activist Stephen Yaxley-Lennon, also known as Tommy Robinson, during a rally, in London, Britain, September 13, 2025. \n                                          | Photo Credit: Reuters A London march organised by far-right activist Tommy Robinson drew more than 1,00,000 people and became unruly on Saturday (September 13, 2025) as a small group of his supporters clashed with police officers who were separating them from counter protesters. Several officers were punched, kicked and struck by bottles tossed by people at the fringes of the “Unite the Kingdom” rally, Metropolitan Police said. Reinforcements with helmets and riot shields were deployed to support the 1,000-plus officers on duty. At least nine people were arrested, but police indicated that many other offenders had been identified and would be held accountable. Police estimated that Mr. Robinson drew about 1,10,000 people, while the rival “March Against Fascism” protest organised by Stand Up To Racism had about 5,000 marchers. Mr. Robinson, whose real name is Stephen Yaxley-Lennon, founded the nationalist and anti-Islam English Defense League and is one of the most influential far-right figures in Britain. The march was billed as a demonstration in support of free speech — with much of the rhetoric by influencers and several far-right politicians from across Europe aimed largely at the perils of migration. Tens of thousands of protesters marched through central London, carrying flags of England and Britain, for a demonstration organized by the anti-immigrant activist Tommy Robinson https://t.co/T8GEzx73KEpic.twitter.com/izDVFt1ZPf “We are both subject to the same process of the great replacement of our European people by peoples coming from the south and of Muslim culture, you and we are being colonised by our former colonies,” far-right French politician Eric Zemmour said. Elon Musk, the Tesla CEO and owner of the X platform who has waded into British politics several times this year, was beamed in by video and condemned the left-leaning U.K. Government. “There's something beautiful about being British and what I see happening here is a destruction of Britain, initially a slow erosion, but rapidly increasing erosion of Britain with massive uncontrolled migration,\" he said. Mr. Robinson told the crowd in a hoarse voice that migrants now had more rights in court than the “British public, the people that built this nation”. The marches come at a time when the U.K. has been divided by debate over migrants crossing the English Channel in overcrowded inflatable boats to arrive on shore without authorisation. Numerous anti-migrant protests were held this summer outside hotels housing asylum-seekers following the arrest of an Ethiopian man who was later convicted of sexually assaulting a 14-year-old girl in a London suburb. Some of those protests became violent and led to arrests. Participants in the “Unite the Kingdom” march carried the St. George's red-and-white flag of England and the union jack, the state flag of the United Kingdom, and chanted “we want our country back.” U.K. flags have proliferated this summer across the U.K. — at events and on village lampposts — in what some have said is a show of national pride and others said reflects a tilt toward nationalism. Supporters held signs saying “stop the boats,” “send them home,” and “enough is enough, save our children.” At the counterprotest, the crowd held signs saying “refugees welcome” and ”smash the far right,” and shouted “stand up, fight back.” Mr. Robinson’s supporters chanted crude refrains about U.K. Prime Minister Keir Starmer, leader of the center-left Labour Party and also shouted messages of support for slain U.S. conservative activist Charlie Kirk. Several speakers paid tribute to Kirk, who was remembered in a moment of silence, followed by a bagpiper playing “Amazing Grace.” One demonstrator held a sign saying: “Freedom of speech is dead. RIP Charlie Kirk.” The crowd at one point stretched from Big Ben across the River Thames and around the corner beyond Waterloo train station, a distance of about three-quarters of a mile (around a kilometre). The marches had been mostly peaceful, but toward the late afternoon, “Unite the Kingdom” supporters threw items at the rival rally and tried to break through barriers set up to separate the groups, police said. Officers had to use force to keep a crowd-control fence from being breached. Counterprotesters heckled a man with blood pouring down his face who was being escorted by police from the group of Robinson supporters. It wasn't immediately clear what happened to him. While the crowd was large, it fell far short of the one of the biggest recent marches when a pro-Palestinian rally drew an estimated 3,00,000 people in November 2023. Mr. Robinson had planned a “Unite the Kingdom” rally last October, but couldn't attend after being jailed for contempt of court for violating a 2021 High Court order barring him from repeating libelous allegations against a Syrian refugee who successfully sued him. He previously served jail time for assault and mortgage fraud. Published - September 14, 2025 09:16 am IST United Kingdom Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-4",
    "text": "China’s military warns Philippines against provocations in South China Sea. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 14, 2025 11:15 am IST - BEIJING A Filipino fisheman rows a boat during a trip near the disputed Scarborough Shoal, in Masinloc, Zambales province, Philippines. File.\n                                          | Photo Credit: Reuters China's military said on Sunday (September 14, 2025) it had conducted \"routine\" patrols in the South China Sea and warned the Philippines against any provocations. The two countries have been engaged in a long-running maritime standoff in the strategic waterway that has included regular clashes between coastguard ships and massive naval exercises. A spokesperson for the Chinese military's Southern Theater Command said the Philippines must immediately stop provoking incidents and escalating tensions in the South China Sea. \"We sternly warn the Philippine side to immediately stop provoking incidents and escalating tensions in the South China Sea, as well as bringing in external forces for backing such efforts that are destined to be futile,\" the spokesperson said. \"Any attempt to stir up trouble or disrupt the situation will not succeed.\" The Philippines' maritime council and armed forces did not immediately respond to questions outside office hours, while the Philippine embassy in Beijing did not immediately respond to a request for comment. The U.S. Indo-Pacific Command said in a statement that Japan, the Philippines, and the United States conducted joint maritime exercises in the Philippines' Exclusive Economic Zone from September 11 to 13 to strengthen regional cooperation and support a free and open Indo-Pacific. \"The U.S., along with our allies and partners, upholds the right to freedom of navigation and overflight and other lawful uses of the sea and international airspace, as well as respect to the maritime rights under international law,\" it said. The United States stands with the Philippines, Secretary of State Marco Rubio said on Friday, rejecting what he described as China's \"destabilising plans\" for a disputed atoll in the South China Sea. China claims almost all the South China Sea — a waterway carrying more than $3 trillion of annual commerce — despite overlapping claims by the Philippines, Brunei, Malaysia and Vietnam. Published - September 14, 2025 09:06 am IST China\n                    \n                            /                      \n                        \n                        Philippines Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-5",
    "text": "Australia to spend U.S. $8 billion on nuclear submarine shipyard facility. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 14, 2025 11:15 am IST - Sydney The government is ploughing money into Perth’s Henderson Defence Precinct after signing the 2021 AUKUS pact with Britain and the United States to arm its navy with nuclear-powered submarines. \n                                          | Photo Credit: AFP Australia will spend an initial Aus$12 billion (U.S.$8 billion) to upgrade shipyard facilities for a future fleet of nuclear-powered submarines, the government said on Sunday (September 14, 2025). The \"very significant\" investment is to be spent over a decade to transform a shipbuilding and maintenance precinct in Perth, Western Australia, Defence Minister Richard Marles said. The government is ploughing money into Perth's Henderson Defence Precinct after signing the 2021 AUKUS pact with Britain and the United States to arm its navy with nuclear-powered submarines. The investment is part of a major military restructure to improve Australia's long-range strike capabilities in the face of China's expanding military strength across the Pacific. Australia, which has no infrastructure to service nuclear-powered submarines, aims to acquire at least three US Virginia-class submarines within 15 years and eventually to manufacture its own subs. \"Henderson is a key piece of the AUKUS story and from that point of view it will be welcomed in the US, as it will be welcomed in the United Kingdom, for sure,\" Mr. Marles told Australia's Sky News. \"But this is about what Australia needs to do in order to meet its strategic moment.\" The investment will equip Henderson with high-security dry docks to maintain nuclear-powered submarines, as well as creating facilities to build landing craft and eventually Japanese Mogami-class frigates, Marles said. The United States is also expected to use shipyard maintenance of its own nuclear-powered submarines, he said. Total costs to develop the Henderson Defence Precinct could eventually reach an estimated Aus$25 billion, the Minister said. The shipyard expansion is the latest in a string of high-profile Australian defence upgrades. Australia announced in August it would equip its navy with 11 Mogami-class frigates built by Japan's Mitsubishi Heavy Industries. Australia will pay Aus$10 billion over the next 10 years to acquire the stealth frigates as it aims to expand its fleet of major warships from 11 to 26 over the next decade. The first three Mogami-class frigates will be built overseas, but Australia hopes to produce the rest in Western Australia. Last week, the Australian government said it would deploy a Aus$1.7 billion fleet of \"Ghost Shark\" underwater attack drones, with the first expected to enter service in January. Questions have been raised about the AUKUS submarine programme, which lies at the heart of Australia's defence strategy and could cost up to U.S.$235 billion over 30 years, according to government forecasts. U.S. President Donald Trump's administration has put AUKUS under review to ensure it aligns with his \"America First agenda\", with some critics saying the United States does not produce enough nuclear-powered submarines to supply Australia as well as its own navy. But Canberra is confident in the pact's future. The Washington Post said U.S. Secretary of State Marco Rubio had privately reassured Mr. Marles two weeks ago that AUKUS would proceed. Mr. Marles declined to discuss the report. But he told Australian public broadcaster ABC that in all his discussions with the Trump administration \"there has been an enormous sense of positivity about the role that AUKUS can play for the United States\". The Minister said his government had made extra defence spending commitments since May 2022 amounting to Aus$70 billion over the next decade, after including the latest shipyard investment. Published - September 14, 2025 08:48 am IST USA\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        nuclear weapons Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-6",
    "text": "Venezuela says U.S. marines raided a fishermen's boat in the Caribbean as tensions rise. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Published - September 14, 2025 07:28 am IST - Caracas Venezuelan government has nonetheless called on its citizens to enlist in the militias - armed volunteers - in support of its security forces in the event of a potential incursion.\n                                          | Photo Credit: AP Personnel from a U.S. warship boarded a Venezuelan tuna boat with nine fishermen while it was sailing in Venezuelan waters, Venezuela's Foreign Minister said on Saturday (September 13, 2025), underlining strained relations with the United States. The White House did not immediately respond to a request for comment. Tensions between the two nations escalated after U.S. President Donald Trump in August ordered the deployment of warships in the Caribbean, off the coast of the South American country, citing the fight against Latin American drug cartels. While reading a statement on Saturday (September 13, 2025), Foreign Minister Yván Gil told journalists the Venezuelan tuna boat was \"illegally and hostilely boarded by a United States Navy destroyer\" and 18 armed personnel who remained on the vessel for eight hours, preventing communication and the fishermen's normal activities. They were then released under escort by the Venezuelan navy. The fishing boat had authorisation from the Ministry of Fisheries to carry out its work, Gil said at a press conference, during which he presented a video of the incident. \"Those who give the order to carry out such provocations are seeking an incident that would justify a military escalation in the Caribbean,\" Mr. Gil said, adding that the objective is to \"persist in their failed policy\" of regime change in Venezuela. Mr. Gil said the incident was \"illegal\" and “illegitimate” and warned that Venezuela will defend its sovereignty against any \"provocation.\" The Venezuelan Foreign Minister's complaint comes days after Mr. Trump said that his country had attacked a drug-laden vessel and killed 11 people on board. Mr. Trump said the vessel had departed from Venezuela and was carrying members of the Tren de Aragua gang, but his administration has not presented any evidence to support that claim. Venezuela accused the United States of committing extrajudicial killings. The South American country's interior minister, Diosdado Cabello, said Washington's version is \"a tremendous lie\" and suggested that, according to Venezuelan government investigations, the incident could be linked to the disappearance of some individuals in a coastal region of the country who had no ties to drug trafficking. The Trump administration has accused Venezuelan President Nicolás Maduro of leading a cartel to flood the U.S. with drugs, and doubled the reward for his capture from $25 million to $50 million. The U.S. government has given no indication that it plans to carry out a ground incursion with the more than 4,000 troops being deployed in the area. But the Venezuelan government has nonetheless called on its citizens to enlist in the militias - armed volunteers - in support of its security forces in the event of a potential incursion. On Saturday (September 13, 2025), it urged them to go to military barracks for training sessions. Published - September 14, 2025 07:28 am IST Venezuela Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-7",
    "text": "After Poland, Russian drone breaches Romanian airspace during attack on neighbouring Ukraine. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 14, 2025 11:12 am IST - BUCHAREST A threat of drone strikes also prompted Poland to deploy aircraft and close an airport in the eastern city of Lublin on Saturday (September 13, 2025). Image used for representative purpose only. \n                                          | Photo Credit: AP Romania scrambled fighter jets on Saturday (September 13, 2025) when a drone breached the country's airspace during a Russian attack on Ukrainian infrastructure near the border, the Defence Ministry said. Defence Minister Ionut Mosteanu said the F-16 pilots came close to taking down the drone as it was flying very low before it left national airspace toward Ukraine. A threat of drone strikes also prompted Poland to deploy aircraft and close an airport in the eastern city of Lublin on Saturday (September 13, 2025), three days after it shot down Russian drones in its airspace with the backing of aircraft from its NATO allies. Romania, a European Union and NATO state which shares a 650-km (400-mile) border with Ukraine, has had Russian drone fragments fall onto its territory repeatedly since Russia began waging war on its neighbour. On Saturday, it scrambled two F-16 fighter jets and later two Eurofighters — part of German air policing missions in Romania — and warned citizens in the southeastern county of Tulcea near the Danube and its Ukrainian border to take cover, the Defence Ministry said in a statement. It added the jets detected a drone in national airspace, which they followed until it dropped off the radar 20 km southwest of the village of Chilia Veche. Mr. Mosteanu told private television station Antena 3 that helicopters will survey the area near the border to look for potential drone parts, \"but all information at this moment indicates the drone exited airspace to Ukraine.\" Ukrainian President Volodymyr Zelenskyy said on social media platform X that data showed the drone breached about 10 kilometres into Romanian territory and operated in NATO airspace for around 50 minutes. \"It is an obvious expansion of the war by Russia — and this is exactly how they act,\" he said. \"Sanctions against Russia are needed. Tariffs against Russian trade are needed. Collective defence is needed.\" NATO announced plans to beef up the defence of Europe's eastern flank on Friday, after Poland shot down drones that had violated its airspace, the first known shots fired by a member of the Western alliance during Russia's war in Ukraine. Romanian lawmakers approved a law earlier this year enabling the army to shoot down drones illegally breaching Romanian airspace during peacetime, based on threat levels and risks to human life and property, but the bill does not yet have all enforcement rules approved. Swedish Foreign Minister Maria Malmer Stenergard wrote on platform X that the airspace breach was \"another unacceptable violation of NATO airspace.\" \"Sweden stands in full solidarity with Romania as a NATO Ally and EU Member State. We are always ready to contribute further to the deterrence and defence of the Alliance.\" Published - September 14, 2025 07:08 am IST Poland\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        Romania Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-8",
    "text": "How has Gen Z uprising forced changes in Nepal? | Explainer\nPremium. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 14, 2025 09:49 am IST Demonstrators gather as smoke rises from the Parliament complex following a fire set during a protest against corruption in Kathmandu, Nepal, on September 9, 2025.\n                                          | Photo Credit: Reuters On September 4, 2025 in Nepal, the (then) ruling Communist Party of Nepal (Unified Marxist-Leninist)’s K.P. Sharma Oli-led government banned 26 major social media platforms, citing non-compliance with registration requirements. This triggered widespread Gen Z-led protests from September 8, with demonstrators viewing it as an attempt to silence dissent. The protests quickly escalated from peaceful gatherings in Kathmandu to violent confrontations as demonstrators marched toward Parliament. At least 34 people have died and over 1,000 were hospitalised. The next day, multiple government buildings were attacked, including Parliament, the Supreme Court, and the Prime Minister’s office complex. Politicians’ homes were burnt down and prisoners freed from jails, including arrested politician and ex-minister Rabi Lamichhane of the Rastriya Swatantra Party (RSP). Prime Minister Oli also resigned on September 9. After three days of negotiations involving the President, Army Chief General Ashokraj Sigdel, and Gen Z leaders, former Supreme Court Chief Justice Sushila Karki was appointed as interim Prime Minister with a mandate to conduct elections by March 2026. She immediately recommended dissolving Parliament. Also read | ‘Unconstitutional’, ‘arbitrary’: Nepal parties slam House dissolution move In recent years, many youngsters of Nepal have migrated out of the country for better job opportunities. Social media outlets are used by a bulk of such people and others, not just for venting about concerns on the nature of governance but also for communication and business. Shutting down these outlets, therefore, was seen as a major inconvenience. The youth, however, did not term the protests as something targeted at the social media ban, but as an agitation against corruption in governance. Ever since the 2015 Constitution, power has alternated between three veteran leaders – Mr. Oli, Mr. Pushpa Kamal Dahal (Prachanda) of the Communist Party of Nepal (Maoist-Centre), and Mr. Sher Bahadur Deuba of the Nepali Congress. Despite the relatively progressive Constitution, governments have been perceived as corrupt and unable to improve economic conditions, providing unstable governance through constantly changing alliances. The 2025 Gen Z uprising differs fundamentally from Jan Andolan 1 (1990) and Jan Andolan 2 (2006) in leadership, triggers, and objectives. Unlike previous movements led by established political parties like the Nepali Congress and UML in 1990, and the Seven Party Alliance with Maoists in 2006, the 2025 protests were driven by Gen Z activists with no traditional party affiliations. The movement was largely coordinated through social media platforms like Instagram and Discord rather than formal political structures. From Discord to Bitchat, tech at the heart of Nepal protests Nepal protests: It’s Gen Z vs ‘nepo kids’ Watch: The rise and fall of K.P. Sharma Oli: Nepal’s embattled leader Jan Andolan 1 was triggered by an Indian trade embargo and aimed at ending the Panchayat system to establish constitutional monarchy. Jan Andolan 2 sought to end absolute monarchy and establish a republic through a Constituent Assembly. The 2025 uprising occurred within an existing democratic republic but challenged the entire political class, demanding dissolution of Parliament and establishment of a new leadership outside traditional party structures. The previous movements operated within or sought to create new constitutional frameworks. The 2025 protests represent a rejection of the post-2015 political settlement rather than seeking systemic constitutional change. In the violence on September 9, multiple government buildings were targeted, including Parliament, the Supreme Court, and the Singha Durbar office complex, which houses the Prime Minister’s office and other ministries. Politicians’ homes were also attacked and burnt. The buildings of Nepal’s largest media house, Kantipur, were also burnt, but the group’s flagship English-language newspaper, The Kathmandu Post, managed to bring out its print edition, even as its internet servers were down. Gen Z activists claimed that vandalism and arson were not done by them but by miscreants who infiltrated the protests. The protests evolved beyond the original movement’s peaceful intentions into widespread destruction of state infrastructure, suggesting involvement of other elements beyond the core Gen Z organisers. While it is too early to say that pro-monarchy activists were responsible for the September 2025 violence, there has been a pattern of pro-monarchist activity in recent months. In March 2025, pro-monarchy rallies turned violent, resulting in casualties when royalist forces clashed with security personnel. Former king Gyanendra’s arrival in Kathmandu that same month sparked rallies calling for monarchy’s return, supported by the Rastriya Prajatantra Party. Following Mr. Oli’s resignation, Nepal entered a three-day power vacuum with intense negotiations among key stakeholders. The selection process involved the President’s Office, the Nepal Army, Gen Z leaders, and major political parties, with the Army Chief playing a crucial mediating role. Hami Nepal, a non-profit organisation led by 36-year-old Sudan Gurung, originally established for earthquake relief in 2015, emerged as a key voice. The organisation had gained credibility through transparent disaster relief work during COVID-19. Gen Z youth conducted extensive online discussions through social media before collectively endorsing Sushila Karki, a former Chief Justice of the Supreme Court. Several prominent figures were considered, including Kathmandu Mayor Balendra Shah (who ultimately endorsed Ms. Karki), former Nepal Electricity Authority chief Kulman Ghising, ex-education minister Sumana Shrestha of the RSP, and Dharan Mayor Harka Sampang. President Ram Chandra Poudel appointed Ms. Karki under Article 61 of the Constitution after extended consultations, citing “extraordinary circumstances.” The dissolution could likely be unconstitutional. Article 76(7) of Nepal’s 2015 Constitution allows dissolution only after failed Prime Minister appointments and requires the PM’s recommendation. Article 66(2) mandates Presidential actions must occur “on [the] recommendation of the Council of Ministers.” No constitutional provision permits dissolution based on public protests alone. ALSO WATCH  Watch: Nepal protests force government out | Should India worry? The fact that dissolution occurred immediately after the interim PM’s appointment makes it constitutionally questionable, as it bypassed prescribed procedures and violated separation of powers principles. This could constitute grounds for judicial review by the Supreme Court’s Constitutional Bench. Major political parties including the Nepali Congress, CPN-UML, and CPN (Maoist Centre), along with the Nepal Bar Association, have condemned the dissolution as “unconstitutional” and “arbitrary,” with lawyers warning that it undermines constitutional supremacy and contradicts previous Supreme Court rulings on parliamentary reinstatement. The 2025 uprising highlights fundamental flaws in Nepal’s post-2015 political settlement. While the 2015 Constitution established a progressive federal democratic republic with provisions for inclusive representation, its implementation has been marked by chronic political instability. Since 2015, power has rotated among the same three leaders through constantly shifting alliances rather than ideological differences. This “musical chairs” approach to governance has prevented consistent policy implementation and economic development, fuelling public disillusionment. Besides, the Constitution’s federal structure remains incomplete, with disputes over provincial boundaries and resource distribution unresolved. The Gen Z movement’s success in forcing extra-constitutional change was an outcome of its impatience with traditional democratic processes. The interim government’s ability to conduct credible elections by March 2026 and whether new political forces can emerge to challenge the established triumvirate will be crucial tests. Nepal’s democratic future depends on whether a newly reconstituted political class can move beyond patronage-based politics toward genuine policy competition, complete the federal transition envisioned in the Constitution, and address youth unemployment and migration. However, if anti-democratic forces exploit this moment to reverse the gains of the previous Jan Andolans, then Nepal will undergo a democratic regression – in line with what has transpired in Bangladesh following its own anti-government, student-driven protests last year. Published - September 14, 2025 04:03 am IST Nepal Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-9",
    "text": "Explosion in Madrid from suspected gas leak injures 25. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 14, 2025 11:21 am IST - Madrid Firefighters work at the site after an explosion in a cafe in Madrid, Spain, on September 13, 2025. Photo: Madrid Emergency Services via Reuters. An explosion in a building in Madrid injured 25 people, two of them seriously, emergency services for the Spanish capital said Saturday (September 13, 2025). Spanish news agency EFE said that firefighters suspect that the explosion was caused by a gas leak, but police were still investigating its cause. Firefighter chief Javier Romero said that firefighters pulled four people from the rubble after the explosion occurred at around 3 p.m. on the ground floor of a three-story building. He said that the blast damaged a cafe, a store and other properties. Published - September 14, 2025 02:56 am IST Spain Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-10",
    "text": "Sébastien Lecornu | Macron’s lieutenant \nPremium. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Published - September 14, 2025 02:44 am IST Illustration: Sreejith R. Kumar “We will succeed... because nothing is impossible,” said Sébastien Lecornu as he gave his maiden speech as France’s Prime Minister at his handover ceremony in Paris on September 9. He was appointed Premier by President Emmanuel Macron in less than 24 hours after the fall of François Bayrou’s government. Mr. Lecornu, 39, is now the country’s fifth Prime Minister in under two years. Born on June 11, 1986 in Eaubonne, Val-d’Oise, Sébastien Lecornu is the son of an aeronautics factory technician and a medical secretary. His modest background, rooted in the small town of Vernon in Normandy, shaped his political outlook. “Unfortunately, I was born old,” he once joked, a self-effacing remark that hinted at both his receding hairline and the weight of early responsibilities. Politics, he says, was always present. “I never imagined myself holding government office so early,” Mr. Lecornu said. Mr. Lecornu recalls the influence of his maternal grandfather, a decorated member of the anti-Nazi Resistance in Calvados during the Second World War, as an inspiration in his political journey. By his late teens, Mr. Lecornu had already entered politics. At 19, he became a parliamentary attaché; at 22, an adviser to Bruno Le Maire, then a rising figure in the French right. At 28, he was elected Mayor of Vernon. By 2020, he had secured a Senate seat for Normandy. Alongside this steady rise, Mr. Lecornu maintained a dual identity: a reserve colonel in the National Gendarmerie (the military police) and a Frenchman fascinated by military history, a passion that would later define his role as France’s Defence Minister. Caution and discretion are the two keys to his longevity in government. A member of President Macron’s centrist Renaissance party, Mr. Lecornu has been a loyal ally since the start of the President’s first term, serving in every cabinet since 2017. He began as Secretary of State for Ecology, moved to overseas affairs, and in 2022 was handed the defence portfolio. As Defence Minister, Mr. Lecornu advocated Mr. Macron’s vision of European strategic autonomy. Since Russia launched its invasion of Ukraine in 2022, Mr. Lecornu has also become the face of France’s military build-up. In 2023, he shepherded the parliamentary vote on a new military planning law that foresaw €413 billion in defence spending from 2024 to 2030. He has cultivated ties across the political spectrum, earning a reputation as “the king of political flirting”. In the words of Gérald Darmanin, France’s long-time Interior Minister and one of Mr. Lecornu’s closest friends, “He has a great capacity for dialogue.”“He talks to everyone — from the hard-left France Unbowed party to the RN, (the far-right National Rally),” François Cormier-Bouligeon, a Renaissance lawmaker, told Le Monde. However, Mr. Lecornu’s career has not been without controversies. As Overseas Minister, he oversaw the 2021 referendum in New Caledonia, which was boycotted by independence groups, undermining the vote’s legitimacy. He also struggled to prevent his home region of Eure from swinging heavily toward Marine Le Pen’s National Rally in both the 2022 presidential and 2024 legislative elections. Green Party leader Marine Tondelier once condemned him as “homophobic”, citing the past comments he made, opposing same-sex marriage and adoption rights. Mr. Lecornu later softened his stance, acknowledging that he had “come a long way”, especially on medically assisted reproduction. Mr. Lecornu studied at the private Catholic lycée Saint-Adjutor in Vernon before beginning a law degree in Paris. He enrolled in a master’s programme in public law, but did not complete it. Today, he lives, accompanied by his dog, Tiga, who is known to roam the corridors of the Armed Forces Ministry. If Mr. Lecornu has sometimes been accused of playing the courtier to Mr. Macron, his loyalty has been rewarded. He has been part of the “Élysée boys’ club” — the President’s tight inner circle — and often accompanied Mr. Macron abroad. During the “Yellow Vest” crisis of 2018–19, he became a key architect of the “great national debate,” persuading the President to engage directly with Mayors and citizens, a move many credited with easing tensions. Now, as Prime Minister, Mr. Lecornu faces the dual challenge of bridging the gap, as he puts it, “between real life and the political situation,” while also securing enough support in a divided Parliament, where no party has a majority, to pass a crucial budget, which is to be signed off by December 31. Published - September 14, 2025 02:44 am IST France\n                    \n                            /                      \n                        \n                        The Hindu Profiles Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-11",
    "text": "Charlie Kirk | Death of a culture crusader \nPremium. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 14, 2025 08:32 am IST Illustration: R. Rajesh Charles James Kirk, 31, a high- profile conservative activist who was an ally of Donald Trump, was shot dead during a university event in Utah on September 10. The suspected shooter, identified as Tyler Robinson, 22, has been taken into custody. Although Kirk has never held an official position in either the government or in the Republican Party, his killing has reverberated beyond the U.S. Calling him a “giant of his generation”, Mr. Trump announced that Kirk would posthumously be awarded the Presidential Medal of Freedom — the country’s highest civilian honour. Israeli Prime Minister Benjamin Netanyahu, wanted by the International Criminal Court for war crimes, praised him as a “lion-hearted friend of Israel”, who “stood tall for Judaeo-Christian civilisation”. Luminaries of Europe’s far-right, from Alice Weidel of Germany’s neo-Nazi Alternative for Germany (AfD) to Italian Prime Minister Giorgia Meloni and Jordan Bardella of France’s National Rally have lionised Kirk, describing him as a champion of free speech and liberty. Also read | Death of Charlie Kirk lays bare deep U.S. political divisions It is unusual for the passing of a political organiser little known outside the U.S. to trigger such an outpouring of tributes from across the Western world. What made Kirk so special? At the time of his death, Kirk’s net worth was $12 million. His journey to the summit of wealth and power has many parallels with the stereotypical journeys of Silicon Valley tycoons, starting with the trope of quitting college to set up their own outfit. Kirk was a political entrepreneur, and a genius at raising money, especially from ageing Conservatives who instantly took a shine to him. He was raised in Prospect Heights, Illinois, and his father was an architect whose firm designed the Trump Tower in New York. His mother was a mental health counsellor. In high school, he spent his lunch breaks listening to the talk radio host Rush Limbaugh. Hypnotised by the right-wing commentator, he dreamed of emulating him. In addition to Mr. Limbaugh’s anti-feminism and anti-environmentalism, he also embraced Conservative author Christopher Caldwell’s notion that the Civil Rights Act upended the Constitution by instituting a regime of racial preference. To these, he added a layer of Biblical obscurantism that added a Christian nationalist ‘finish’ to his political ideas. In April 2012, Kirk wrote an essay for Breitbart News, the influential far-right website, alleging “liberal bias” in high school economics textbooks. It earned him an appearance on Fox News which, in turn, fetched him an audience with Tea Party activist Bill Montgomery, a man half a century his senior. Mr. Montgomery, and subsequently, conservative investment manager Foster Friess, 81, became Kirk’s early donors and mentors. In July 2012, at the age of 18, Kirk co-founded Turning Point USA, a non-profit focused on advocating conservative politics on college and university campuses. This was a field dominated by the likes of Young America’s Foundation and Young Americans for Liberty, whose primary mode of advocacy was to get celebrated right-wing provocateurs to give talks on campus. Kirk, according to the New York Times journalist Robert Draper, took the game to another level — by training and funding student-government candidates, acting “as a kind of PAC for youngsters”. He also set up the notorious ‘Professor Watchlist’, which sought to red flag academics who espoused views contrary to Turning Point’s, especially on LGBTQ persons and race. Scholars on the watch list were subjected to relentless attacks by right-wing trolls who also pressured their employers to fire them. On university campuses where liberal progressives were part of the establishment, Kirk presented conservative politics as a ‘cool’ space for youthful rebellion, particularly among youngsters who saw themselves as non-ideological. At the same time, he promoted conservatism in a Trumpist avatar, creating a heady cocktail of MAGA populism and Christian nationalism which he showcased through public debates with campus liberals. Kirk’s penchant for these ‘open debates’ is often invoked by those who present him as a champion of free speech. But these were less ‘debates’ and more performative spectacles where oppositional voices were a structural requirement — they were needed for Kirk to put on an exhibition of verbal combat whose terms he controlled. He recorded these exchanges and posted them on social media where they went viral. As Kirk flew from campus to campus on a private jet sponsored by his donors, his growing mass of young supporters helped him raise more funds for Turning Point. Kirk leveraged his youth base and access to old conservative donors to obtain access to the higher levels of the Republican Party. Once he had impressed Donald Trump Jr. by streamlining his social media strategy, it was a matter of time before he caught the eye of the senior Trump, who anointed him as the ‘youth guy’ of the GOP. There is no doubt Kirk was instrumental in delivering the youth vote to the Trump campaign. It is a direct outcome of his sustained engagement with college students through Turning Point USA, which quickly amassed 250,000 members and chapters in over 850 colleges. In addition to his college tours, Kirk used his podcasts, TV appearances, and high-decibel social media presence to fashion himself as a diehard Trump loyalist with a powerful yet credible voice in the MAGA ecosystem. But it was a popularity of its time – forged in a polarised society through bigotry, racism, and hate speech that deepened the fault lines. In a culture that censures speaking ill of the dead, it is easy to miss the fact that Kirk was an unapologetic White supremacist who believed that the “Civil Rights Act was a mistake”, that Martin Luther King Jr. “was not a good person” and that Black women “do not have the brain processing power to otherwise be taken really seriously”. He believed that Palestine is not a place that exists, that Muslims planned to “conquer Europe by demographic replacement”, and Jewish donors are the “number one funding mechanism” of “quasi-Marxist policies”. He described transgender people as “an abomination to God”. He despised feminism, famously telling Taylor Swift, “Reject feminism. Submit to your husband. You’re not in charge.” He opposed empathy on principle, stating that “empathy is a made-up new-age term that does a lot of damage”. On guns, Kirk’s views tracked those of the National Rifle Association, as he held that it was worth “the cost of, unfortunately, some gun deaths every single year so that we can have the Second Amendment”. In the aftermath of Kirk’s killing, politicians and commentators from across the political spectrum have bemoaned the rise of ‘political violence’ in America. Sadly, Kirk’s most ardent followers are the least likely to acknowledge that the fires lit by political hate speech demonising the ‘other’ may one day consume the self too. Published - September 14, 2025 02:20 am IST The Hindu Profiles\n                    \n                            /                      \n                        \n                        USA Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-12",
    "text": "From the Bench to the helm\nPremium. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 14, 2025 01:48 am IST Illustration: Sreejith R. Kumar In 2008, Nepal declared itself a federal democratic republic. The 2015 Constitution formalised it. But who would have thought, on the eve of the 10th anniversary of the Constitution, the Himalayan nation of 30 million people would be picking its Prime Minister at the Army Headquarters? Editorial | Generational rage: On the upheaval in Nepal After Nepal’s youth-led protests against misrule and corruption led to the fall of the K.P. Sharma Oli government last week, the Army stepped in to maintain law and order, with Army chief Gen. Ashok Sigdel appointed as the chief negotiator. When youth campaigners, largely dubbed as Gen Z, proposed the name of Sushila Karki, Gen. Sigdel facilitated the process to appoint her as the head of the new government. She was administered the oath of office by President Ram Chandra Poudel on Friday at a brief ceremony. Ms. Karki, the first woman Chief Justice of Nepal, is now the country’s first woman Prime Minister. Born on June 7, 1952, in Biratnagar, some 380 km southeast of Kathmandu, she holds a Master’s degree in political science from Banaras Hindu University, and a law degree from Tribhuvan University, Kathmandu. ALSO WATCH  Watch: Nepal interim Prime Minister: Former Chief Justice Sushila Karki takes oath She married Durga Subedi, who was then a leader of the Nepali Congress. A 1973 plane hijack to raise funds for the Nepali Congress was reportedly masterminded by Mr. Subedi. Those who have worked with her and known her personally say Ms. Karki has maintained probity throughout her career. Her anti-corruption stand has been exemplary. She began her career in law in 1979 and became a senior advocate in 2007. Two years later, she was appointed a Supreme Court judge. In 2010, she became a permanent justice of the Supreme Court. ALSO WATCH  Watch: Nepal protests force government out | Should India worry? After serving as Acting Chief Justice from April 13 to July 10, 2016, she was appointed Chief Justice on July 11. She retired on June 7, 2017. Her refusal to bow to political pressure earned her a reputation as a woman of mettle, while also inviting an impeachment motion by the Nepali Congress and the CPN (Maoist Centre). The motion was later withdrawn after the Supreme Court barred further proceedings. Balram K.C., a former Supreme Court judge, says there could not have been any better person to lead the country at this time. “The Gen Z campaigners, whose entire campaign was against corruption, are right to back someone who always championed clean and transparent governance,” he said. Since her retirement, Ms. Karki has remained active in public forums on various judicial and social issues, including anti-corruption efforts. She rose to public prominence as a judge in 2012 when she convicted Nepali Congress leader J.P. Gupta in a corruption case while he was still serving as Minister of Information and Communications. It was she who had issued the order to reopen a case against then-Chief of the Commission for the Investigation of Abuse of Authority, Lokman Singh Karki, in response to a review petition. Later, in a landmark verdict, a full bench of three justices, excluding her, disqualified Lokman Singh from office in 2017. Ms. Karki’s decision to revive the case had drawn widespread attention at the time.In yet another landmark ruling, she directed the government to investigate an Army official in the rape and murder of Maina Sunar, a case that became a symbol of human rights violations from the state side during the 1996–2006 Maoist insurgency. On more than one occasion after her retirement, she publicly stated that political party leaders often exert undue pressure to appoint judges under “their quota” — a revelation of how the judiciary was being politicised and maligned. Hardly any politician has escaped her straightforward and scathing opprobrium. Despite making it to the Supreme Court on the Nepali Congress quota, Ms. Karki never hesitated to call out Congress leaders for their wrongdoings and misconduct. Lok Raj Baral, a professor and former Ambassador of Nepal to India, says his acquaintance with Ms. Karki goes back a long way and he has always been impressed by her no-nonsense personality. “She speaks her mind and refuses to compromise,” Mr. Baral said. “It’s her integrity that gives her the strength.” That is not to say she is without controversy. She has faced allegations of favouring political figures in judicial appointments and of lacking impartiality in some decisions. In 2013, when then-Chief Justice Khil Raj Regmi was picked by Nepal’s political parties to lead an interim government to oversee elections to the Constituent Assembly, Ms. Karki and then-Acting Chief Justice Kalyan Shrestha had argued that Justice Regmi’s dual role was against the spirit of the Interim Constitution. At the time, criticism had mounted that a sitting Chief Justice leading the executive violated the principle of separation of powers. So, as Ms. Karki was being considered to lead an interim government — akin to the one once led by Mr. Regmi — some critics were quick to point to her past stance. However, observers say it’s not the right time to dwell on past incidents and debate over the constitutionality of the process. “If one were to split hairs, one can find foibles in everyone. So that’s not the issue here. Her anti-corruption stand has been impeccable and our Gen Z fought to root out corruption,” Mr. Balram said. “What needs to be ensured is that Ms. Karki and her soon-to-be-formed Cabinet get full support of the people for a smooth transition.” Immediately after assuming office on Friday night, Ms. Karki, as the Prime Minister, recommended dissolution of Parliament and declared elections for March 5, 2026. “What has been plaguing this country is the lack of rule of law, rampant corruption, and the highhandedness of political parties,” Ms. Karki has said on multiple occasions at public forums. “Once all these are rooted out, no one can stop Nepal from charting the path of peace and prosperity.” As Ms. Karki is set to form a Cabinet, immense challenges lie ahead — she has to launch an independent probe into the September 8 violence in which 19 young people were killed, and a criminal investigation into September 9 arson and vandalism, restoring confidence among the Nepali people. The biggest task on her shoulders is to conduct free and fair elections to restore the democratic and constitutional process and give back Parliament its inherent right to pick the Prime Minister. Published - September 14, 2025 01:36 am IST The Hindu Profiles\n                    \n                            /                      \n                        \n                        World\n                    \n                            /                      \n                        \n                        Nepal Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-13",
    "text": "Once banned Islami Chhatra Shibir-backed panel wins Jahangirnagar University students’ union poll in Bangladesh. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 14, 2025 12:43 am IST - New Delhi This image is used for representational purposes only.\n                                          | Photo Credit: Getty Images/iStockphoto A year after it was banned, Islami Chhatra Shibir, the student wing of Bangladesh Jamaat-e-Islami, won a major university poll in Bangladesh on Saturday (September 13, 2025). With this victory at the Jahangirnagar University located near the capital Dhaka, Shibir now has two of the most important university campuses under its control in Bangladesh. On September 10, Shibir swept the Dhaka University Central Students Union (DUCSU) election. The victory of the Islami Chhatra Shibir in the DUCSU polls was welcomed by Jamaat-e-Islami Pakistan. The victory of the Shibir-backed panel in Jahangirnagar University was welcomed by Shafikur Rahman, Ameer of Jamaat in Bangladesh, on Saturday (September 13, 2025), who said, “Today a big responsibility has been placed on the students. Hope they will give the highest importance to preserving our trust.” Shibir was banned by the Sheikh Hasina-led government in the first week of August 2024 before her government fell in the student-people uprising on August 5, 2024. The ban was lifted by the interim government. The student union polls in Bangladesh have attracted attention as they are coming just five months ahead of the February 2026 election in Bangladesh amidst growing pressure from the Islamists to exclude political parties like deposed Prime Minister Sheikh Hasina’s Awami League. The elections in Dhaka University and Jahangirnagar University are expected to be followed by polls in the universities in Rajshahi, Chittagong and other universities where Shibir’s victory is expected to create positive sentiment in favour of the Shibir candidates. The victory in the student union polls is also adding to the overall political dynamics in Bangladesh, with the Islamist-led eight-party grouping deciding on a joint plan of action ahead of the election that was announced by Chief Adviser Prof. Mohammed Yunus earlier on August 5. Bangladesh’s leading daily, Prothom Alo, on Saturday (September 13, 2025), reported that Jamaat-e-Islami, the interim government-backed National Citizen Party (NCP), Charmonai Peer-led Islami Andolon Bangladesh, Bangladesh Khelafat Majlis, Khelafat Majlis, Gono Odhikhar Parishad, Amaar Bangladesh Party (a moderate splinter group of Jamaat), and Bangladesh Nezam–e–Mustafa have started demanding that the next election in Bangladesh should be based on “proportionate representation” – the PR system – so that “all parties get a level field”. The grouping is expected to demand that the July Declaration, as announced by Prof. Yunus on August 5, should be the leading document of the modern Bangladesh state. One of the key demands that is expected to be announced on Sunday (September 14, 2025) by the eight-party grouping centres around banning 14 political parties that were associated with deposed PM Sheikh Hasina from contesting the next election. Awami League’s political activities have been banned by the interim government since last October, though the party continues to hold on to its strongholds like Gopalganj, where its cadre fought a pitched street battle with the interim government-backed National Citizens Party on July 16. The eight-party grouping has also demanded that the Jatiyo Party, which was once led by the late President Hossein Mohammed Ershad, should be banned from participating in the polls for being “allies of Fascism.” Published - September 14, 2025 12:42 am IST Bangladesh Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-14",
    "text": "‘Unconstitutional’, ‘arbitrary’: Nepal parties slam House dissolution move. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 14, 2025 03:55 am IST - Kathmandu Taking charge: Sushila Karki visits victims injured in clashes with\nsecurity personnel in Kathmandu on September 13, 2025.\n                                          | Photo Credit: Reuters Nepal’s major political parties and apex lawyers’ body have strongly criticised the President’s decision to dissolve Parliament, describing the move as “unconstitutional”, “arbitrary” and a serious blow to democracy. The criticism followed Friday’s (September 14, 2025) recommendation by the first Cabinet meeting chaired by interim Prime Minister Sushila Karki to dissolve the House of Representatives, a proposal that President Ram Chandra Poudel promptly approved. Political parties across the spectrum slammed the dissolution move. Disapproving of the move, the Nepali Congress (NC), the largest political party in the country, warned that any action violating the Constitution would be unacceptable. The Central Executive Committee meeting of the Nepali Congress held on Saturday concluded that the dissolution of the Parliament has “jeopardised the democratic achievements” of the country, the MyRepublica news portal reported. Important judicial records nearly destroyed in student-led protests: Nepal Supreme Court From Discord to Bitchat, tech at the heart of Nepal protests Watch: How did a social media ban lead Nepal’s Gen Z to protest against systemic corruption “This move to dissolve Parliament is against the spirit of our Constitution and the interpretation of the Supreme Court. It is absolutely unconstitutional,” the NC said in a statement. NC general secretary Bishwa Prakash Sharma said any breach of the Constitution raises serious questions. CPN-UML general secretary Shankar Pokharel described the move as “ironically concerning”. The CPN (Maoist Centre) also expressed serious disagreement with the decision to dissolve the House of Representatives, asserting that the decision of dissolution went against the country’s constitutional framework. Published - September 13, 2025 11:28 pm IST Nepal Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-15",
    "text": "North Korea to boost nuclear arsenal, conventional military: state media. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Published - September 13, 2025 09:23 pm IST - Seoul North Korean leader Kim Jong Un. File\n                                          | Photo Credit: Reuters North Korean leader Kim Jong Un said Pyongyang will unveil a policy to advance both its nuclear arsenal and conventional military power at an upcoming key ruling party meeting, state media said Saturday (September 13, 2025). Since a failed summit with the United States in 2019, North Korea has repeatedly said it will never give up its nuclear weapons and declared itself an \"irreversible\" nuclear state. While visiting weapons research facilities this week, Mr. Kim said Pyongyang \"would put forward the policy of simultaneously pushing forward the building of nuclear forces and conventional armed forces\", according to the state-run Korean Central News Agency. Mr. Kim also emphasised the need to \"modernise\" the country's conventional armed forces, without specifying the date of the party meeting. The North Korean leader has been emboldened by the war in Ukraine, securing critical support from Russia after sending thousands of North Korean troops to fight alongside Moscow. Moscow and Pyongyang signed a mutual defence pact last year when Russian President Vladimir Putin visited the reclusive state. Seoul has repeatedly warned that Russia is stepping up support for Pyongyang, including the potential transfer of sensitive Russian military technology, in return for North Korea's assistance in fighting Ukraine. \"In essence, it reflects (Kim's) view that nuclear forces alone have limits as a deterrent, and that Pyongyang is seeking to boost its war-fighting capability by modernizing its conventional arsenal,\" Hong Min, a senior analyst at the Korea Institute for National Unification, told AFP. \"North Korea's military technology cooperation with Russia seems to be also expanding into the conventional arms sector, and modernisation plans tailored to 'modern warfare' are likely to be laid out as a mid- to long-term agenda\" at the upcoming meeting, he added. At the last party congress in January 2021, Kim unveiled an ambitious military agenda, pledging to develop advanced weapons such as military spy satellites and solid-fuel intercontinental ballistic missiles. Analysts say they expect the upcoming meeting to be held early next year. Mr. Kim and Mr. Putin flanked China's President Xi Jinping at a massive parade in Beijing this month, drawing an acidic response from US President Donald Trump, who accused the three leaders of plotting against the United States. Published - September 13, 2025 09:23 pm IST North Korea Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-16",
    "text": "Russia claims another village in Ukraine's Dnipropetrovsk. September 14, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 14, 2025e-Paper Updated  - September 13, 2025 09:18 pm IST - Moscow This photograph shows a destroyed house and car following a shelling, in Mezhova, Dnipropetrovsk region, on July 9, 2025. \n                                          | Photo Credit: AFP Russia on Saturday (September 13, 2025) said it had captured a new village in Ukraine's central Dnipropetrovsk region, which Moscow's forces say they reached at the beginning of July. The Defence Ministry said its troops had seized the village of Novomykolaivka near the border with the Donetsk region — the epicentre of fighting on the front. AFP was unable to confirm this claim. DeepState, an online battlefield map run by Ukrainian military analysts, said the village was still under Kyiv's control. Russian forces are better equipped and vastly outnumber Ukrainian troops. They have been carrying out offensives in Ukraine for months and gaining ground across the eastern front. At the end of August, Ukraine had for the first time acknowledged that Russian soldiers had entered the Dnipropetrovsk region, where Moscow had claimed advances at the start of the month. The Russian army currently controls about a fifth of Ukrainian territory. The Kremlin is demanding that Ukraine withdraw from its eastern Donbas region as a precondition for halting hostilities, something that Kyiv has rejected. The Dnipropetrovsk region is not one of the five Ukrainian regions — Donetsk, Kherson, Lugansk, Zaporizhzhia, and Crimea -- that Moscow has publicly claimed as Russian territory. On Friday, Ukrainian President Volodymyr Zelenskyy said his Russian counterpart, Vladimir Putin, wanted to \"occupy all of Ukraine\" and would not stop until his goal was achieved, even if Kyiv agreed to cede territory. For its part, the Kremlin noted on Friday that peace negotiations with Kyiv were on \"pause,\" following the failure of several attempts in recent months to diplomatically resolve the conflict triggered by Russia's full-scale offensive in February 2022. A Russian shelling attack on the town of Kostyantynivka in Ukraine's eastern Donetsk region killed three people earlier Saturday, regional prosecutors said. Published - September 13, 2025 09:17 pm IST Russia\n                    \n                            /                      \n                        \n                        Ukraine Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-17",
    "text": "Arab, Muslim leaders to meet in Qatar to denounce Israeli attack. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Published - September 13, 2025 09:13 pm IST - Doha Smoke rises from an explosion, after an Israeli strike, in Doha, Qatar, on Tuesday, Sept. 9, 2025. \n                                          | Photo Credit: AP Qatar said Saturday (September 13, 2025) it will host a summit of Arab and Muslim leaders to denounce Israel's attack on Hamas officials in Doha and to show solidarity with the Gulf state. Monday's meeting would consider \"a draft resolution on the Israeli attack on the State of Qatar\" to be drafted Sunday (September 14) at a Ministerial meeting, said foreign ministry spokesman Majed al-Ansari. The summit reflected \"broad Arab and Islamic solidarity with the State of Qatar in the face of Israel's cowardly aggression... and the categorical rejection of Israel's state terrorism\", he said, quoted by the official QNA news agency. Among the leaders attending will be Iranian President Masoud Pezeshkian and Iraqi Prime Minister Mohammed Shia al-Sudani. Turkish President Recep Tayyip Erdogan will also be in Doha, but his presence at the meeting is yet to be confirmed. Israel targeted Hamas leaders Tuesday in strikes on the Qatari capital, killing five Hamas members and a Qatari security officer. The attack drew widespread international condemnation, including from Gulf monarchies allied with the United States, Israel's main backer. Qatar, which hosts the largest U.S. base in the region, plays a mediation role in the Gaza war alongside the United States and Egypt. Analysts say the summit is meant to send Israel a clear signal. The Israeli strikes were \"seen across the Gulf as an unprecedented violation of sovereignty and an attack on diplomacy itself\", Andreas Krieg of King's College London said, adding the summit signalled that \"such aggression can't be normalised\". \"The goal is to draw clear red lines and end the sense in Israel that it can act with impunity,\" he said. \"Expect a sharper stance on Palestine and a harder edge on Israeli actions.\" Published - September 13, 2025 09:13 pm IST Qatar\n                    \n                            /                      \n                        \n                        international relations Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-18",
    "text": "Israel ramps up strikes on Gaza City, hospital says at least 32 killed. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Published - September 13, 2025 06:40 pm IST - Deir al-Balah Palestinians run for cover during an Israeli military strike on a building in Gaza City, Saturday, Sept. 13, 2025. \n                                          | Photo Credit: AP A barrage of airstrikes killed at least 32 people across Gaza City as Israel ramps up its offensive there and urges Palestinians to evacuate, medical staff reported Saturday (September 13, 2025). The victim included 12 children, according to the morgue in Shifa Hospital, where the bodies were brought. Israel in recent days has intensified strikes across Gaza City, destroying multiple high-rise buildings and accusing Hamas of putting surveillance equipment in them. It has ordered residents to leave, part of an offensive aimed at taking over the largest Palestinian city, which it says is Hamas' last stronghold. Hundreds of thousands of people remain there, struggling under conditions of famine. One of the strikes overnight and into early morning Saturday hit a house in the Sheikh Radwan neighbourhood, killing a family of 10, including a mother and her three children, said health officials. Images showed the strikes hitting, followed by plumes of smoke. Israel's army didn't immediately respond to questions about the strikes. In the wake of escalating hostilities and calls to evacuate the city, the number of people leaving has spiked in recent weeks, according to aid workers. However, many families remain stuck because of the cost of finding transportation and housing, while others having been displaced too many times and don't want to move again, not trusting that anywhere in the enclave is safe. In a message on social media Saturday, Israel's army told the remaining Palestinians in Gaza City to leave “immediately” and move south to what it's calling a humanitarian zone. Army spokesman Avichay Adraee said that more than a quarter of a million people had left Gaza City — from an estimated 1 million who live in the area of north Gaza around the city. The United Nations however, put the number of people who have left at around 100,000 between mid-August and mid-September. The UN and aid groups have warned that displacing hundreds of thousands of people will exacerbate the dire humanitarian crisis. Sites in southern Gaza where Israel is telling people to go are overcrowded, according to the UN, and it can cost money to move, which many people don't have. An initiative headed by the UN to bring temporary shelters into Gaza said more than 86,000 tents and other supplies were still awaiting clearance to enter Gaza as of last week. Gaza's Health Ministry said Saturday that seven people including children died from malnutrition-related causes over the past 24 hours, raising the toll to 420, including 145 children, since the war began. The bombardment Friday night across Gaza City came days after Israel launched a strike targeting Hamas leaders in Qatar, intensifying its campaign against the militant group and endangering negotiations over ending the war in Gaza. Families of the hostages still held in Gaza are pleading with Israel to halt the offensive, worried it'll kill their relatives. There are 48 hostages still inside Gaza, around 20 of them believed to be alive. The war in Gaza began when Hamas-led militants stormed into southern Israel on October 7, 2023, abducting 251 people and killing some 1,200, mostly civilians. Israel's retaliatory offensive has killed at least 64,803 Palestinians, according to Gaza's Health Ministry, which does not say how many were civilians or combatants. It says around half of those killed were women and children. Large parts of major cities have been completely destroyed and around 90 per cent of some 2 million Palestinians have been displaced. (AP)\t   GSP Published - September 13, 2025 06:40 pm IST Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        Palestine\n                    \n                            /                      \n                        \n                        Israel Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-19",
    "text": "Watch: How did a social media ban lead Nepal’s Gen Z to protest against systemic corruption. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper What began as protests against censorship turned into a deadly uprising, with police firing, leaving more than 20 dead and Prime Minister K. P. Sharma Oli resigning. Updated  - September 13, 2025 06:36 pm IST - The Hindu Explains Presentation: Sharmada V Editing: Aniket Singh Chauhan Script and research: Shikha Kumari A Video: Shivaraj S Published - September 13, 2025 06:18 pm IST Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-20",
    "text": "U.S. officials hold talks in Kabul over Americans detained in Afghanistan. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Published - September 13, 2025 05:59 pm IST Adam Boehler, White House presidential envoy for hostage affairs. File \n                                          | Photo Credit: AP U.S. officials held talks on Saturday (September 13, 2025) with the authorities in Kabul over Americans held in Afghanistan, the Taliban administration’s Foreign Ministry said. Adam Boehler, the Trump administration’s special envoy for hostage response, and Zalmay Khalilzad, a former U.S. special envoy for Afghanistan, met with the Taliban’s Foreign Minister Amir Khan Muttaqi. \"Both parties emphasized the continuation of talks on various current and future issues in bilateral relations, particularly regarding citizens imprisoned in each other’s countries,\" said a statement from the Afghan foreign ministry. There was no immediate statement from Washington on the meeting. Mr. Khalilzad did not immediately reply to a phone call seeking comment. Mahmood Habibi, a naturalised U.S. citizen, is the most high-profile American detainee, according to Washington. The Taliban denies holding him. The Taliban administration, which took power in 2021 after 20 years of U.S. military intervention in Afghanistan, is not recognised by Washington. Published - September 13, 2025 05:59 pm IST Afghanistan\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        diplomacy Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-21",
    "text": "Trump calls on all NATO countries to stop buying Russian oil, threatens 50% to 100% tariffs on China. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 07:05 pm IST President Donald Trump proposed that NATO, as a group, place 50-100% tariffs on China to weaken its economic grip over Russia. File.\n                                          | Photo Credit: AP U.S. President Donald Trump issued a letter to NATO nations on Saturday (September 13, 2025), urging them to stop buying Russian oil and impose major sanctions on Russia to end its war in Ukraine. \"I am ready to do major sanctions on Russia when all NATO nations have agreed, and started, to do the same thing, and when all NATO nations stop buying oil from Russia,\" he said in a social media post. Also read | Donald Trump’s criticism of India for its oil and arms trade with Russia is factual but illogical: Data He proposed that NATO, as a group, place 50-100% tariffs on China to weaken its economic grip over Russia. This follows Mr. Trump's earlier threats of sanctions on Moscow and secondary sanctions on countries buying its oil, such as top buyers China and India, if no progress is made to end the war in Ukraine. The President has imposed an additional 25% tariff on Indian goods, citing its continued imports of Russian oil, but has not taken similar action against China. Published - September 13, 2025 05:53 pm IST Donald Trump\n                    \n                            /                      \n                        \n                        NATO\n                    \n                            /                      \n                        \n                        Russia Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-22",
    "text": "Pakistani Army says clashes near the Afghan border killed 12 soldiers and 35 militants. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Published - September 13, 2025 05:32 pm IST - PESHAWAR, Pakistan TTP has become emboldened since the Afghan Taliban seized power in Kabul in 2021, with many of the Pakistani Taliban leaders and fighters finding sanctuary across the border. File.\n                                          | Photo Credit: Reuters Pakistani security forces raided two hideouts of the Pakistani Taliban near the Afghan border in the past two days, triggering fierce clashes that killed 12 soldiers and 35 militants, the military said Saturday (September 13, 2025). The death toll underscores the struggles Pakistan faces as it tries to rein in resurging militant groups. The military said 22 militants were killed in the first raid in Bajaur, a district in northwestern Khyber Pakhtunkhwa province. Thirteen more were killed in a separate operation in South Waziristan district, the military said. The statement said that the 12 soldiers, “having fought gallantly, paid the ultimate sacrifice and embraced martyrdom” in South Waziristan. The militants are using Afghan soil to stage attacks in Pakistan, the military said, urging the Taliban government in Kabul “to uphold its responsibilities and deny use of its soil for terrorist activities against Pakistan.” The military described the killed militants as “Khwarij,” a term the government uses for the Pakistani Taliban, and alleged they were backed by India though it offered no evidence for the allegation. Pakistan has long accused India of supporting the Pakistani Taliban and separatists in Baluchistan, charges that New Delhi denies. There was no immediate comment from the Taliban in Kabul or from New Delhi. Pakistan has faced a surge in militant attacks in recent years, most claimed by the Pakistani Taliban, also known as Tehrik-e-Taliban Pakistan, or TTP. The group is separate from the Afghan Taliban but is closely allied with them. TTP has become emboldened since the Afghan Taliban seized power in Kabul in 2021, with many of the Pakistani Taliban leaders and fighters finding sanctuary across the border. Published - September 13, 2025 05:32 pm IST Pakistan\n                    \n                            /                      \n                        \n                        Afghanistan Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-23",
    "text": "Indian-origin man gets life sentence for mother's murder in U.K.. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Published - September 13, 2025 05:13 pm IST - London Image used for representation \n                                          | Photo Credit: Getty Images/iStockphoto A 39-year-old Indian-origin man who killed his mother at her home in Birmingham has been sentenced to life imprisonment with a minimum term of 15 years behind bars before being considered for parole. Surjit Singh had pleaded guilty to killing 76-year-old Mohinder Kaur, who was found to have died of injuries consistent with receiving several blows in September last year. The sentence was handed down at Birmingham Crown Court on Friday, when it emerged that a row over a television remote control led to an intoxicated Singh fatally attacking his mother. “This senseless killing has torn apart a family, and our thoughts remain with everyone affected,” said West Midlands Police Detective Inspector Nick Barnes. Singh, who lived as a carer for his widowed mother at the family home in the Soho area of Birmingham, is said to have lost his temper after she criticised him for being intoxicated. Cocaine and alcohol were later detected in his blood following the attack, which he informed a relative about before leaving the home. West Midlands Police said the concerned relative phoned the emergency 999 number after which police officers forced their way into the property, where they found Mohinder Kaur lying on the living room floor. She was taken to the Queen Elizabeth Hospital in Birmingham, where she was later pronounced dead. Singh later returned to the scene of the attack and was arrested by officers who were still at the house. While in custody, he told the police: “I didn’t mean to do it. I just lost my head.” “Mohinder died as a result of injuries consistent with a number of blows, but it was not clear if a weapon was used or what the motive was,” the police said. The court later heard how Singh had repeatedly kicked and stamped on his mother after chasing her around. According to local court reports, the sentencing judge described it as a “sustained attack over a considerable period of time” on an elderly and frail woman who was unable to protect herself. Published - September 13, 2025 05:13 pm IST United Kingdom\n                    \n                            /                      \n                        \n                        murder\n                    \n                            /                      \n                        \n                        crime, law and justice Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-24",
    "text": "Palestinian factions hand over truckloads of weapons in Lebanon’s largest refugee camp. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Published - September 13, 2025 04:22 pm IST - SIDON Lebanese army soldiers escort a truck carrying weapons handed over by Palestinian factions from Rashidiyeh refugee camp to the Lebanese army in Tyre, south Lebanon. File \n                                          | Photo Credit: AP Palestinian factions in two refugee camps in Lebanon handed over truckloads of weapons to authorities on Saturday (September 13, 2025) as part of a deal reached earlier this year to remove arms not under Lebanese State control. The latest transfer of weapons, which has been slow since it began last month, took place in the Ein el-Hilweh refugee camp, the largest in Lebanon, near the southern port city of Sidon, and the Beddawi refugee camp near the northern city of Tripoli. State-run National News Agency and a Palestinian spokesman said three trucks full of weapons from the Beddawi camp were headed to a Lebanese army barracks inside Tripoli. The spokesman for the Palestinian National Security Forces in Lebanon, Abdul Hadi al-Assadi, said in a statement that five truckloads of weapons also were handed over at Ein el-Hilweh. He said the weapons belonged to factions that are part of the Palestine Liberation Organization. Over the past few weeks, weapons were handed over to Lebanese troops in camps in Beirut and the southern province of Tyre. The 12 Palestinian refugee camps in Lebanon are not controlled by the Lebanese State. Ein el-Hilweh, home to nearly 75,000 people, includes militant Islamic groups that are not part of the deal to hand over the weapons. Clashes between members of Palestinian President Mahmoud Abbas’ Fatah group and rival Islamist factions in 2023 left 30 people dead and hundreds wounded. Palestinian refugees and their ancestors in Lebanon are not given citizenship, ostensibly to preserve their right to go back to the homes they fled or were forced from during the 1948 creation of the State of Israel, which now bans them from returning. They are prohibited from working in most professions, from medicine to the banking sector. Because of restrictions on ownership, what little property they have is bought under Lebanese names, leaving them vulnerable to embezzlement and expropriation. Published - September 13, 2025 04:22 pm IST Palestine\n                    \n                            /                      \n                        \n                        Lebanon\n                    \n                            /                      \n                        \n                        armed conflict Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-25",
    "text": "U.S. asks G7 countries to impose tariffs on countries purchasing oil from Russia. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 03:20 pm IST - New York/Washington U.S. Treasury Secretary Scott Bessent. \n                                          | Photo Credit: Reuters The U.S. has asked G7 countries to impose tariffs on countries purchasing oil from Russia, asserting that only “unified efforts” that cut off funding to Moscow's war machine at source can apply sufficient pressure to end “the senseless killing.” U.S. Treasury Secretary Scott Bessent and the United States Trade Representative Ambassador Jamieson Greer were on a call with G7 Finance Ministers on Friday (September 12, 2025) when they reiterated President Donald Trump's call to the bloc's partners about imposing tariffs on countries purchasing oil from Russia. François-Philippe Champagne, Canada's Minister of Finance and National Revenue, chaired a meeting of G7 Finance Ministers to discuss further measures to increase pressure on Russia to end its war against Ukraine. G7 is an intergovernmental bloc of rich, industrialised countries comprising the United States, Canada, France, Germany, Italy, Japan, and the U.K. Canada is the head of the rolling G7 presidency this year. “During today's call with G7 Finance Ministers, Secretary Bessent reiterated President Trump's call to our G7 partners that, if they are truly committed to ending the war in Ukraine, they should join the United States in imposing tariffs on countries purchasing oil from Russia,” a U.S. Treasure Department statement said after the call. The statement did not name any country. But the U.S. has often blamed India and China for purchasing Russian oil even when there are no tariffs on Beijing for it. “Only with a unified effort that cuts off the revenues funding (Russian President Vladimir) Putin’s war machine at the source will we be able to apply sufficient economic pressure to end the senseless killing,” said Secretary Bessent and Ambassador Greer. “Thanks to President Trump’s bold leadership, the United States has already taken dramatic action against the purchasers of Russian oil. We are encouraged by the assurances of our fellow G7 nations that they are committed to ending this war, and we are hopeful that they will join us in taking decisive action at this critical time,” the statement added. The U.S. has doubled tariffs on Indian goods to a whopping 50%, including a 25% additional duty for India's purchase of Russian crude oil, an action that New Delhi has described as “unfair, unjustified and unreasonable.” India has been maintaining that its energy procurement, including buying oil from Russia, is driven by national interest and market dynamics. India and the U.S. have been negotiating a bilateral trade agreement since March. So far, five rounds of negotiations have been completed. For the sixth round, the U.S. team, which was to visit India last month, deferred its visit due to the imposition of a 50% tariff on Indian goods by Washington. Trade relations between the two countries have been strained due to the high tariffs. The two countries had earlier announced plans to conclude the first phase of the India-U.S. bilateral trade agreement by the fall of 2025. A statement from Champagne said, “Russia's increasingly aggressive stance, including recent bombings in Ukraine and Wednesday's violation of Polish airspace by Russian drones, and its unwillingness to agree to a ceasefire have prompted this G7 meeting.” Canada, as part of its G7 Presidency, remains committed to working closely with G7 allies to increase pressure on Russia and support Ukraine's long-term security and recovery, he said in the statement posted on X. “G7 Ministers agreed to accelerate discussions to further use immobilised Russian sovereign assets to fund Ukraine's defence, and to explore other mechanisms that would allow further increasing financial support to Ukraine,” it added. Secretary Bessent and Ambassador Greer also welcomed commitments to increase sanctions pressure and explore using immobilised Russian sovereign assets to further benefit Ukraine’s defence, it said. On Friday, President Trump, when asked in an interview with ‘Fox and Friends’ what clamping down on his Russian counterpart entails, said: “Look, India was their biggest customer. I put a 50% tariff on India because they're buying oil from Russia. That's not an easy thing to do. That's a big deal and it causes a rift with India.” Published - September 13, 2025 03:08 pm IST USA\n                    \n                            /                      \n                        \n                        Russia Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-26",
    "text": "Myanmar air strike kills at least 19 high school students: armed group. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Published - September 13, 2025 02:00 pm IST - Bangkok Debris is seen after an alleged army airstrike hit two private schools in Thayet Thapin village in Kyauktaw township in Rakhine state, Myanmar, Friday, Sept. 12, 2025. \n                                          | Photo Credit: AP A Myanmar ethnic minority armed group said on Saturday (September 13, 2025) that a junta air strike killed at least 19 students, including children, in western Rakhine state. The Arakan Army (AA) is engaged in a fierce fight with Myanmar's ruling military for control of Rakhine, where it has seized swaths of territory in the past year. The Rakhine conflict is one element of the bloody chaos that has engulfed Myanmar since the military ousted Aung San Suu Kyi's civilian government in a 2021 coup, sparking a widespread armed uprising. The AA posted a statement on Telegram on Saturday saying the attack on two private high schools in Kyauktaw township happened just after midnight Friday, killing 19 students between the ages of 15 and 21 and wounding 22 more. \"We feel as sad as the victims' families for the death of the innocent students,\" the statement said. It blamed the junta for the strike, but AFP's calls to the junta spokesman for comment about the incident have not been answered. Local media outlet Myanmar Now reported that a junta warplane dropped two 500-pound bombs on a high school as students slept. In a statement, UNICEF condemned the \"brutal attack\", which it said \"adds to a pattern of increasingly devastating violence in Rakhine State, with children and families paying the ultimate price\". AFP was unable to reach people on the ground around Kyauktaw where internet and phone services are patchy. The military is struggling to fight opposition to its rule on multiple fronts around Myanmar and it has been regularly accused of using air and artillery strikes to hit civilian communities. Published - September 13, 2025 02:00 pm IST Myanmar\n                    \n                            /                      \n                        \n                        civil unrest Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-27",
    "text": "Funeral set for Indian-origin man beheaded in Dallas; fundraiser for family nears $200,000. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 01:10 pm IST - Houston Representative image.\n                                          | Photo Credit: Getty Images/iStockphoto The family of Chandra Mouli \"Bob\" Nagamallaiah, the Indian-origin motel manager brutally beheaded in Dallas earlier this week, will hold his funeral on Saturday (September 13, 2025) at 2 p.m. at Flower Mound Family Funeral Home in Flower Mound, Texas. A fundraiser launched to support Nagamallaiah's wife, Nisha, and 18-year-old son, Gaurav — who witnessed the attack — has raised nearly $200,000, at last reckoning, to help cover funeral expenses and Gaurav's college education. Nagamallaiah, 50, was killed at the Downtown Suites motel by co-worker Yordanis Cobos-Martinez, a 37-year-old Cuban national with a violent criminal history. Cobos-Martinez was released from ICE custody earlier this year after Cuba refused to accept his deportation due to his criminal record. Assistant Secretary of Homeland Security Tricia McLaughlin said the case underscores broader immigration challenges. \"This is exactly why the Trump Administration was removing criminal illegal aliens to third countries such as Uganda and South Sudan,\" she said, pointing out policy gaps that allowed the suspect to remain in the country despite a deportation order. The Consulate General of India in Houston is closely monitoring the case and providing consular support. Consul General DC Manjunath said the consulate \"is in contact with the family and local authorities, offering all necessary assistance.\"  The Indian-American community expressed shock and grief. Gitesh Desai, president of SEWA International's Houston chapter, said, \"This crime has devastated our community. We are offering every form of support possible to the grieving family.\"  The Vishwa Hindu Parishad of America condemned the killing, calling it part of a disturbing national trend. \"These tragedies highlight an alarming societal breakdown — where political discord erodes cohesion, violence spreads unchecked, and government responses are mere lip service. We demand full investigations and a national inquiry into America's collapsing civil dialogue,\" it said. Indiaspora, a global network of Indian-origin leaders, said it was \"deeply saddened and horrified by the brutality of this crime\" and condemned the violent act \"in the strongest possible terms.\" \"Every person deserves safety and dignity regardless of identity,\" it said. Dallas Police have confirmed the killing was recorded on motel CCTV cameras. Cobos-Martinez remains jailed without bond pending trial. Published - September 13, 2025 01:07 pm IST Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-28",
    "text": "Israel slams Pakistan at UNSC, says 'cannot change fact that bin Laden was killed on your territory'. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 12:46 pm IST - United Nations Israel’s Ambassador to the United Nations Gilad Erdan. \n                                          | Photo Credit: Reuters Pakistan cannot change the fact that Al-Qaida chief Osama bin Laden was sheltered and killed on its soil, Israel has said, as it lashed out at Islamabad in the UN Security Council for its \"double standards\". \"When bin Laden was eliminated in Pakistan,\" Israel’s Permanent Representative to the UN Ambassador Danny Danon said, pointing his hand towards Pakistan's UN Ambassador Asim Iftikhar Ahmad, “the question asked was not 'why target a terrorist on foreign soil'?\" \"No one asked that question. The question was, 'Why was a terrorist given shelter at all?' The same question must be asked today. There was no immunity for bin Laden, and there can be no immunity for Hamas,” Mr. Danon said. The sharp exchange between the envoys of Israel and Pakistan came on Thursday at a Security Council meeting held to discuss the Israeli attack on Hamas leaders in the Qatari capital of Doha. In his remarks, Mr. Ahmad strongly condemned what he called Israel’s “illegal and unprovoked aggression” against Qatar, terming it part of a \"broader and consistent pattern of aggression\" that undermines regional peace. The Pakistani envoy accused Israel of repeatedly violating international law through \"brutal\" military actions in Gaza, and repeated cross-border strikes in Syria, Lebanon, Iran and Yemen. The UNSC meeting took place on the 24th anniversary of the 9/11 terror attacks in New York City, orchestrated by bin Laden. Mr. Danon said \"that tragic day (9/11), like October 7 for Israel, was a day of fire and blood\". He recalled that in the days following the 9/11 attacks, the Security Council had adopted a resolution, which stated that no nation may harbour terrorists, nor fund them and give them haven. “Any government that does so breaks this Council’s binding obligations. That principle was clear then; it must be upheld today,” the Israeli envoy said. Mr. Ahmad took the floor again to respond to Mr. Danon's statement. \"It is unacceptable, indeed ludicrous for an aggressor, an occupier, a serial violator of the UN Charter and international law, that is Israel, to abuse this chamber and disrespect the sanctity of this Council. This is not the first time. And by pointing fingers at others, baseless assertions primarily aimed at masking its own illegal actions and violations of international law,” he said. In a strong retort, Mr. Danon said if the Pakistani envoy wanted to read the statement, he could have done it at the beginning of the session. “The fact is that Osama bin Laden was killed in Pakistan, and no one condemned the US. And when other countries in this Council attack terrorists, no one condemns them. And that is the issue of double standards. When you apply different standards to Israel than the standards you apply to yourselves, that is the problem of this institution. \"...you cannot change the fact that 9/11 happened... You cannot change the fact that Osama bin Laden was in Pakistan, and he was killed on your territory. But I would ask you, when you criticise us, and I'm sure it will continue in the future, think about the issue of double standards, which standards you apply to your country and which standards you apply to Israel,” Mr. Danon said. U.S. forces eliminated bin Laden in a special operation conducted in May 2011 at Abbottabad in Pakistan's Khyber Pakhtunkhwa province, where the Al-Qaeda leader had been hiding. Published - September 13, 2025 12:12 pm IST Pakistan\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        Palestine Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-29",
    "text": "Important judicial records nearly destroyed in student-led protests: Nepal Supreme Court. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Published - September 13, 2025 10:50 am IST - Kathmandu A view of the Supreme Court building, which was set on fire by the protesters amid the violent protest against the government over alleged corruption, in Kathmandu on September 10, 2025.\n                                          | Photo Credit: ANI Nepal’s Supreme Court has said that important documents forming part of the country's judicial history were nearly destroyed in the recent student-led anti-government protests, even as it pledged to resume operations at the earliest. “We remain steadfast and determined on the path of justice under all circumstances,” Chief Justice Prakashman Singh Raut said in a statement on Thursday (September 11, 2025). Nepal unrest LIVE: PM Modi congratulates Sushila Karki on taking oath as Nepal PM “We pledge to resume court operations at the earliest to address citizens’ expectations of justice,” he was quoted as saying by MyRepublica news portal on Saturday (September 13, 2025). The Chief Justice expressed grief over the damage caused to court buildings owing to arson, stone-pelting, vandalism and looting during the Gen-Z movement that swept across the country. “Important documents integral to Nepal’s judicial history nearly destroyed in the violence,” he said. Former Chief Justice Sushila Karki is Nepal’s first woman Prime Minister Mr. Raut also expressed sorrow over the deaths of Nepali citizens in the violence and conveyed condolences to the bereaved families, while wishing a speedy recovery to those injured. According to the latest data released by Nepal Police, at least 51 people, including an Indian national, died in the student-led protests that culminated in the fall of the K.P. Sharma Oli government on Tuesday (September 9, 2025). The agitation, which began on Monday (September 8, 2025) against a government ban on social media, quickly expanded into a larger campaign reflecting public anger over corruption and perceived apathy of the political class. In Focus Podcast | Nepal on the Brink: Will the old guard step aside? The ban on social media was lifted on Monday night (September 8, 2025), but violence continued with protesters torching Parliament, the President’s Office, the Prime Minister’s residence, government buildings, political party offices and homes of senior leaders. Former Chief Justice Sushila Karki was sworn in on Friday night (September 12, 2025) as Nepal’s first woman Prime Minister to head an interim government, ending days of political uncertainty. Published - September 13, 2025 10:50 am IST World\n                    \n                            /                      \n                        \n                        Nepal\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        politics (general)\n                    \n                            /                      \n                        \n                        riots\n                    \n                            /                      \n                        \n                        civil unrest Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-30",
    "text": "Magnitude 7.4 quake strikes off Russian Far East, tsunami warning lifted. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 11:13 am IST - Moscow Photo: https://earthquake.usgs.gov/earthquakes/map/ A 7.4-magnitude earthquake struck off the coast of Kamchatka in Russia’s Far East on Saturday (September 13, 2025), the United States Geological Survey (USGS) said. There was no risk that the quake had triggered a tsunami, according to the Pacific Tsunami Warning Centre (PTWC). The USGS said the quake hit 111 kilometres (69 miles) east of the Russian city of Petropavlovsk-Kamchatsky, the administrative centre of the Kamchatka region, at a depth of 39.5 kilometres. The survey earlier gave a magnitude of 7.5 before downgrading it. The PTWC initially warned that “hazardous” waves of up to one metre (3.3 feet) were possible along some nearby Russian coasts. The centre later said “the tsunami threat... has now passed”. In July, one of the strongest earthquakes ever recorded struck off the Kamchatka peninsula, triggering tsunamis up to four metres high across the Pacific and sparking evacuations from Hawaii to Japan. The magnitude 8.8 quake was the largest since 2011, when a magnitude 9.1 tremor off Japan caused a tsunami that killed more than 15,000 people. July’s quake prompted authorities in Japan to order almost two million people to head to higher ground. Tsunami warnings were also issued across the region, before being rescinded or downgraded. Published - September 13, 2025 08:43 am IST earthquake\n                    \n                            /                      \n                        \n                        Russia Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-31",
    "text": "Who is Tyler Robinson, the suspect in Charlie Kirk's murder?. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 10:40 am IST - WASHINGTON, Utah Combination image of Tyler Robinson (left), the suspected killer of conservative activist Charlie Kirk (right)\n                                          | Photo Credit: Utah Governor’s office, Reuters Eighteen-year-old Tyler Robinson seemingly had a bright future ahead of him. The Utah teen had scored in the top percentile on his college entrance exam and earned himself a four-year scholarship to Utah State University in Logan. His proud mother posted a video on Facebook in which her first-born son, the oldest of three, read aloud the school's letter offering him the grant. \"He's so excited to start his journey and it's going to be so amazing for him!\" she wrote in another post. Four years later, authorities say, Robinson fired a rifle shot on Tuesday (September 9, 2025) from atop a building at another university campus, killing conservative influencer Charlie Kirk and triggering a new round of national anxiety over rising political violence. Investigators are still working to understand what led Robinson to that rooftop. Officials have not yet identified a precise motive for the shooting, though they offered some clues on Friday morning in announcing his arrest. Utah Governor Spencer Cox told reporters that a family member interviewed by law enforcement said Robinson had recently mentioned Kirk's scheduled appearance at Utah Valley University, where he was shot. \"They talked about why they didn't like him and the viewpoints he had,\" Mr. Cox said, without offering further details. Robinson had also become more political in recent years, the family member told investigators, and authorities said he had engraved what appeared to be anti-fascist messages on bullet casings they found with the suspected murder weapon. Robinson, now 22, was arrested for aggravated murder and other charges. He has no criminal history, according to state records reviewed by Reuters. He was a registered voter but was not affiliated with a political party, according to voter records. He is listed as an \"inactive\" voter, which indicates he did not cast a ballot in last year's presidential election, when Republican Donald Trump defeated Democrat Kamala Harris. At the time of the shooting, Robinson was living at his parents' house in Washington, a farming and residential community of approximately 28,000 near Zion National Park in southwestern Utah. Robinson's gray Dodge Challenger — the vehicle that authorities say he drove to the site of the shooting on Tuesday — was parked on Friday outside the two-story stucco home, in a relatively new housing development built among alfalfa fields. The image released by the Federal Bureau of Investigation (FBI) shows an image of a person of interest in the investigation into the fatal shooting of Charlie Kirk that occurred on September 10, 2025, at Utah Valley University in Orem, Utah. \n                                                            | Photo Credit: \n                                AFP Dozens of media members were gathered outside, along with half a dozen police cars parked along the street. Officers were stopping reporters from approaching the home. A neighbour, Steven Green, said he knew the family from attending the same Mormon church down the street. \"Great family, good kids,\" he said, though he noted he did not know Tyler Robinson well. Robinson was arrested late on Thursday without incident after a family friend called authorities and said Robinson had either confessed or implied that he was responsible for Kirk's murder, officials said. Robinson graduated in 2021 from Pine View High School in St. George, Utah. A video online of the commencement ceremony shows him carrying his diploma on stage as attendees cheer. He briefly attended Utah State University in Logan for one semester that fall, the school confirmed to Reuters. It was not immediately clear why he left, but Dixie Technical College, part of Utah's public university system, confirmed that he is a third-year student in the school's electrical apprenticeship program. A Facebook post from his mother said Robinson had earned a score of 34 in high school on the ACT college entrance exam, which would put him in the top 1% of test takers, according to the Princeton Review test preparation company. He has two younger brothers, according to his parents' Facebook posts. His mother listed her job online as a social worker at a non-profit healthcare company, while his father is the principal of a company that makes stone countertops, according to state records. His mother's Facebook posts over the years – most of which were deleted on Friday – mostly doted on her family: documenting trips to Alaska, the Caribbean and Disneyland; celebrating school plays, Halloween costumes and adopted pet rabbits; expressing pride as the three boys moved up in school. None of the posts appeared overtly political. Other posts show Robinson and his brothers occasionally with guns, though that is not uncommon in a state with permissive firearms laws. Robinson's arrest on Thursday evening capped a 33-hour manhunt for Kirk's killer, which included the detention of two other persons of interest on Wednesday who were later released. Robinson was booked into the Utah County jail in Spanish Fork, about 12 miles (19 km) south of the university where Kirk was shot. He has not yet been formally charged. Published - September 13, 2025 07:30 am IST USA\n                    \n                            /                      \n                        \n                        murder Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-32",
    "text": "Three die in Ukraine's Sumy region, Zelenskyy says Russian offensive there has failed. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 05:55 am IST A firefighter works at the site of a Russian drone strike, amid Russia’s attack on Ukraine, in Sumy, Ukraine, in this handout picture released September 12, 2025. Photo: State Emergency Service of Ukraine in Sumy region via Reuters An early morning Russian attack killed three people on Friday (September 12, 2025) in northern Ukraine’s Sumy region, a regional official reported, but President Volodymyr Zelenskyy said Moscow’s attempts to advance in the area had failed with heavy losses. Russian forces are engaged in a long, grinding drive along the 1,000 km (620-mile) front through eastern Ukraine, but have also tried in recent months to gain a foothold in areas like Sumy, a border region next to Russia’s Kursk region. They have captured a string of villages near the border and subject larger towns, like the city of Sumy, to frequent shelling. Sumy Regional Governor Oleh Hryhory said a 6 a.m. (0300 GMT) drone and missile attack killed three residents in or near Sumy and injured five. But Mr. Zelenskyy, quoting Ukraine’s top military commander, Oleksandr Syrskyi, said the Russian operation in the region “has been completely foiled by our forces.” “Fighting continues in the border areas of Sumy region, but the Russian grouping in the Sumy direction has lost its offensive capabilities as a result of the losses it has suffered,” he wrote on Telegram. Mr. Zelenskyy has reported successes in other operations in Sumy in recent weeks. He said Kyiv’s forces were also actively repelling Russian troops in Donetsk and Zaporizhzhia, the two main areas on the front line. Russia’s Defence Ministry said its forces had captured a new village, Ternove, in Dnipropetrovsk region in the centre of Ukraine. It was the second day in a row that Russia reported seizing a village in that region, adding to a list of several such localities in recent weeks. Ukraine has emphasised in public statements its efforts to keep Russians from gaining any ground there. Ukraine’s popular war blog DeepState, which uses open-source reports to track military positions, reported Russian gains near Ternove and at least one other village in the area. But another military blogger reported that Ukrainian forces had taken back one village in the region from Russian troops. Published - September 13, 2025 04:55 am IST Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        armed conflict Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-33",
    "text": "G7 finance ministers discuss possible sanctions, tariffs on supporters of Russia's war. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 06:24 am IST - OTTAWA A drone views shows the Evian Resort hotel where the 2026 G7 summit will take place in Evian-les-Bains, France, September 12, 2025. \n                                          | Photo Credit: Reuters The Group of Seven nations’ finance ministers, in a meeting on Friday (September 12, 2025), discussed possibly imposing sanctions and trade measures such as tariffs on countries that they consider to be “enabling” Russia’s war in Ukraine, according to a statement released by the Canadian finance ministry. The G7 finance ministers held the meeting to discuss further measures to increase pressure on Russia to end its war against Ukraine, according to the statement from Canada, the head of the rolling G7 presidency. They “discussed a wide range of possible economic measures to increase pressure on Russia, including further sanctions and trade measures, such as tariffs, on those enabling Russia’s war effort.” Published - September 13, 2025 03:06 am IST finance (general)\n                    \n                            /                      \n                        \n                        G7 summit\n                    \n                            /                      \n                        \n                        summit\n                    \n                            /                      \n                        \n                        Canada Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-34",
    "text": "Imposing tariffs for Russian oil purchases ‘causes a rift with India’, says Trump. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 06:33 am IST - New York Congo and Rwanda, I solved it. It was going on for 31 years, millions of people killed. I solve wars that was unsolvable,” U.S. President Donald Trump said. File\n                                          | Photo Credit: Reuters U.S. President Donald Trump said imposing tariffs on India for buying Russian oil is not an easy thing to do, and it “causes a rift with India.” “Look, India was their biggest customer. I put a 50% tariff on India because they’re buying oil from Russia. That’s not an easy thing to do. That’s a big deal and it causes a rift with India,” Mr. Trump said in an interview with ‘Fox and Friends’ on Friday (September 12, 2025), when asked what clamping down on Russian President Vladimir Putin entails. “But I’ve already done it. I’ve done a lot,” Mr. Trump said. “And remember this is a Europe problem much more than our problem,” Mr. Trump added. In the interview, Mr. Trump also repeated his claim that he has solved seven conflicts so far in his second term as President. “I solved seven wars. I did so many, including Pakistan and India, but big ones, some were unsolvable. Congo and Rwanda, I solved it. It was going on for 31 years, millions of people killed. I solve wars that was unsolvable,” he said. Defending its purchase of Russian crude oil, India has been maintaining that its energy procurement is driven by national interest and market dynamics. Published - September 13, 2025 01:18 am IST Donald Trump\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        India-United States Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-35",
    "text": "France sends jets to Poland, the U.K. ramps up sanctions in a signal to Russia not to escalate. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 05:45 am IST - WARSAW “The security of the European continent is our top priority. We will not yield to Russia’s growing intimidation,” Emmanuel Macron posted on X. File\n                                          | Photo Credit: AP France said on Friday (September 12, 2025) it’s deploying fighter jets to Poland, and the U.K. announced fresh sanctions targeting Russia’s oil revenues and war machine as Europe’s first, measured steps to Russia’s drone incursion into Poland aimed to send a signal to Moscow that any further aggression won’t go unchecked. French President Emmanuel Macron said he would deploy three advanced Rafale fighter jets to help protect Poland’s airspace and NATO’s eastern flank to fulfil a commitment he made to Polish Prime Minister Donald Tusk. He said the deployment was discussed with both NATO Secretary-General Mark Rutte and British Prime Minister Keir Starmer. “The security of the European continent is our top priority. We will not yield to Russia’s growing intimidation,” Mr. Macron posted on X. France’s Defense Ministry said the Rafales will carry out patrol missions alongside other NATO aircraft and will be accompanied by personnel on the ground. There will also be equipment and munitions. Britain’s new sanctions include bans on 70 vessels that the U.K. says is part of Russia’s “shadow fleet” that transports Russian oil in defiance of sanctions already in place. Some 30 individuals and companies — including Chinese and Turkey-based firms — have also been sanctioned for their part in supplying Russia with electronics, chemicals, explosives and other weapons components. The new sanctions came as British Foreign Secretary Yvette Cooper made her first trip to Kyiv on Friday (September 12, 2025) after her appointment a week ago following Mr. Starmer’s Cabinet shake-up. Ms. Cooper said her visit is a demonstration of solidarity with Ukraine which faces a tenfold missile and drone Russian assault from a year ago. “The U.K. will not stand idly by as Putin continues his barbaric invasion of Ukraine,” Ms. Cooper said, noting what she said was the Russian president’s “complete disregard for sovereignty” by sending drones in to NATO airspace. “International action to increase economic pressure on Russia and to cut off critical cash flows which he desperately needs to pay for this illegal war is vital,” he added. Reflecting Britain’s support for Ukraine, Prince Harry made a surprise visit to Kyiv where he’s meeting with wounded service members on Friday (September 12, 2025). Poland’s Foreign Minister Radek Sikorski was also visiting Kyiv on Friday (September 12, 2025). His Ukrainian counterpart Andrii Sybiha posted on X that the two officials would discuss “shared security, Ukraine’s EU and NATO accession, and pressure on Moscow.” Meanwhile, Poland’s Defense Ministry said it will work with Ukraine to train personnel on anti-drone defence. Wednesday’s (September 10, 2025) multiple Russian drone strike on Polish soil rattled Europe’s leaders who saw it as a deliberate provocation and forced them to confront long-standing fears that Russia’s three-year war on Ukraine could precipitate a wider conflict. It also compelled NATO allies to take a closer look at the means at their disposal to counter any further threats. Also, on Friday (September 12, 2025), Russia stoked European unease as it launched a long-planned joint military exercise with Belarus aiming to showcase close defence ties between Moscow and Minsk, as well as Russia’s military might. U.S.-led efforts to steer Moscow and Kyiv toward a peace settlement have so far failed to get traction. Kremlin spokesperson Dmitry Peskov said talks to end the war in Ukraine were currently on “pause” even though channels of communication between negotiators remain open. “One cannot simply put on rose-tinted glasses and expect that the negotiation process will yield lightning-fast results,” Mr. Peskov said. “The Russian side remains ready to follow the path of peaceful dialogue.” Russian air defences downed 221 Ukrainian drones over more than a dozen Russian regions early on Friday (September 12, 2025), Russia’s Defense Ministry said. The attack involved some of the highest numbers of drones reported by the Russian military, but there have been no reports of any significant damage. Meanwhile, Mr. Tusk, the Polish prime minister, dismissed U.S. President Donald Trump’s suggestion that the drone incursion into Poland may have been “a mistake.” “We would also wish that the drone attack on Poland was a mistake,” Mr. Tusk wrote on X. “But it wasn’t. And we know it,” he said. Published - September 12, 2025 11:47 pm IST France\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Poland\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-36",
    "text": "Watch: Nepal interim Prime Minister: Former Chief Justice Sushila Karki takes oath. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Nepal has sworn in former Chief Justice Sushila Karki as its first woman interim Prime Minister to lead a government tasked with holding elections within six months. Published - September 12, 2025 11:39 pm IST Report: Pallavi Keswani Narration: Athira Madhav Published - September 12, 2025 11:39 pm IST Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-37",
    "text": "At least 193 passengers killed in two boat accidents in northwestern Congo. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Updated  - September 13, 2025 03:08 am IST - KINSHASA Google Maps image locates Lukolela territory in Democratic Republic of Congo. Two separate boat accidents this week in northwestern Congo killed at least 193 people dead and left scores missing, authorities and state media reported on Friday (September 12, 2025). The accidents happened on Wednesday (September 10, 2025) and Thursday (September 11, 2025), about 150 km apart in the Equateur province. One boat with nearly 500 passengers caught fire and capsized on Thursday (September 11, 2025) evening along the Congo River in the province’s Lukolela territory, Congo’s humanitarian affairs ministry said in a report. The report said 209 survivors were rescued following the accident, involving a whaleboat near the village of Malange in Lukolela territory. A day earlier, a motorised boat capsized in the Basankusu territory of the province, killing at least 86 people, most of them students, state media reported. Several people were missing, but the reports did not give a figure of how many. It was not immediately clear what caused either accident or whether rescue operations were continuing Friday (September 12, 2025) evening. State media attributed Wednesday’s (September 10, 2025) accident to “improper loading and night navigation,” citing reports from the scene. Images that appeared to be from the scene showed villagers gathered around bodies as they mourned. A local civil society group blamed Wednesday’s (September 10, 2025) accident on the government and claimed the toll was higher. Authorities could not be immediately reached for comment. The capsizing of boats is becoming increasingly frequent in this central African nation as more people are abandoning the few available roads for cheaper, wooden vessels crumbling under the weight of passengers and their goods. In such trips, life jackets are rare, and the vessels are usually overloaded. Many of the boats also travel at night, complicating rescue efforts during accidents and leaving many bodies often unaccounted for. Published - September 12, 2025 11:14 pm IST Democratic Republic of Congo\n                    \n                            /                      \n                        \n                        maritime accident Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-38",
    "text": "Rubio to offer Israel support despite Qatar strike. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Published - September 12, 2025 11:08 pm IST - Washington U.S. Secretary of State Marco Rubio. File \n                                          | Photo Credit: Reuters U.S. Secretary of State Marco Rubio will leave Saturday (September 13, 2025) on a trip to Israel to offer support before French-led moves to recognise a Palestinian state, the State Department said. Mr. Rubio is going ahead with the visit despite U.S. President Donald Trump gently reprimanding Israel for a surprise attack on Hamas on Tuesday in Qatar, a key U.S. partner. Mr. Rubio will speak to Israeli leaders about \"our commitment to fight anti-Israel actions, including unilateral recognition of a Palestinian state that rewards Hamas terrorism,\" State Department spokesman Tommy Pigott said in a statement. Mr. Rubio will emphasize \"the U.S. commitment to Israeli security,\" Mr. Pigott said. \"He will also emphasise our shared goals: ensuring Hamas never rules over Gaza again and bringing all the hostages home,\" he said, adding that Mr. Rubio will meet families of hostages. He said that Mr. Rubio would discuss Israel's \"operational goals and objectives\" in its new offensive, which includes a goal of seizing the already rubble-strewn territory's main urban hub of Gaza City. The statement made no mention of the strikes in Qatar, although Rubio on Friday will meet in Washington with the Gulf state's Prime Minister Sheikh Mohammed bin Abdulrahman Al Thani. Israel on Tuesday carried out strikes on Hamas leadership in Qatar, which has served as a key intermediary with Hamas, whose leaders were gathering to discuss a new ceasefire proposal put forward by the Trump administration. Mr. Trump called the attack unfortunate and said that the United States found out too late to stop it. Mr. Trump has repeatedly offered strong backing to Prime Minister Benjamin Netanyahu, doing away with most of the public concerns, however cautiously expressed, of his predecessor Joe Biden. The State Department did not immediately confirm reports that Mr. Rubio would take part in the inauguration of a new tunnel in Jerusalem's Old City for visitors approaching the Temple Mount, the holiest site for Jews, which is also sacred for Muslims as the Al-Aqsa compound. \"Rubio's visit is nothing less than American recognition of Israeli sovereignty over the most sensitive part of Jerusalem's Holy Basin, contradicting Washington's long-standing position since 1967,\" anti-settlement advocacy group Peace Now said in a statement. Israel seized East Jerusalem in the 1967 war and later annexed it and declared Jerusalem its indivisible capital, a step not recognized by most of the world. But Mr. Trump during his first term bucked the international consensus and moved the U.S. Embassy to Jerusalem. The Trump administration has declined to criticise ramped-up Israeli settlement activity in the West Bank. Mr. Netanyahu vowed Thursday there would be no Palestinian state and \"this place belongs to us\" at a signing ceremony for a major settlement project. But Mr. Netanyahu has walked back from far-right calls for a wide annexation of the West Bank after warnings by the United Arab Emirates, which took the landmark step five years ago of normalizing with Israel. Israel launched an all-out offensive in Gaza in October 2023 following a massive attack launched from territory by Hamas that resulted in the deaths of 1,219 people, mostly civilians, according to an AFP tally based on Israeli figures. Israel's retaliatory offensive has killed more than 64,000 Palestinians, most of them civilians, according to figures from the Health Ministry in Hamas-run Gaza that the United Nations considers reliable. The UN has declared famine in parts of Gaza, which Israel contests. Published - September 12, 2025 11:08 pm IST USA\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        Qatar Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-39",
    "text": "2 persons injured in Palestinian stabbing attack near Jerusalem. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Published - September 12, 2025 10:54 pm IST - Jerusalem Image used for representation \n                                          | Photo Credit: iStockphotos/ Getty Images Two people were wounded in a stabbing attack at a hotel in Tzuba, an Israeli kibbutz less than 10 kilometres west of Jerusalem, medics said, with police reporting that the Palestinian assailant had been arrested. \"EMT (emergency medical technician) and paramedics are treating two stabbing victims and evacuating them to hospital, including a 60-year-old male in serious condition and a 23-year-old male in moderate condition,\" according to a statement by Israel's Magen David Adom emergency service. Israeli police said an individual \"from the Shuafat area carried out a stabbing attack against guests at a hotel in Kibbutz Tzuba, injuring them\". The Shuafat neighbourhood and nearby refugee camp are in east Jerusalem, which has been occupied by Israel since 1967. An officer at the scene \"subdued the terrorist, placing him under arrest,\" the police added. Published - September 12, 2025 10:54 pm IST Palestine Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-40",
    "text": "Former Chief Justice Sushila Karki is Nepal’s first woman Prime Minister. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 01:58 am IST - KATHMANDU Nepal’s President Ramchandra Paudel administers the oath of office to Sushila Karki as Prime Minister during a ceremony at the President’s residence in Kathmandu on September 12, 2025.\n                                          | Photo Credit: PTI Nepal President Ram Chandra Poudel appointed former Chief Justice Sushila Karki as the country’s new Prime Minister and dissolved the Parliament on Friday (September 12, 2025), as days of political turmoil showed signs of abating in the Himalayan nation. He also announced fresh elections on March 5, 2026. President Poudel has announced elections to the House of Representatives for March 5, 2026. The House dissolution comes soon after Ms. Karki was sworn in as the Prime Minister of an interim Cabinet. Mr. Poudel administered the oath of office and secrecy to Ms. Karki at a brief ceremony. Ms. Karki, 73, the first woman Chief Justice of Nepal, is now the country’s first woman Prime Minister. Following hectic meetings that began late on Thursday (September 11, 2025), Mr. Poudel on Friday (September 12, 2025) evening agreed to dissolve Parliament, a key demand of Gen Z protesters who brought down the government of K.P. Sharma Oli on September 9, and decided to appoint her as head of an interim government. She will soon form a Cabinet that will oversee the next elections within six months, according to the Office of the President. Also read: Nepal unrest highlights | Sushila Karki becomes first woman to lead government Even after Gen Z campaigners agreed on Ms. Karki’s name as the leader of the next government, a dispute over the dissolution of Parliament had delayed the process of her appointment. Mr. Poudel has held several rounds of consultations with Ms. Karki and other legal experts, facilitated by the Army, since Thursday (September 11, 2025) night. According to sources and experts he consulted, the Nepali President was extremely concerned that dissolving Parliament before appointing the head of government could give a free rein to the new Cabinet, with nobody to hold it accountable. Ms. Karki, however, backed the protesters’ demand that the House be dissolved. Protesters argued that if Parliament was not dissolved, the same old parties against whom they fought would retain their control and influence. Sudan Gurung, a prominent Gen Z campaigner, said on Thursday (September 11, 2025) that House dissolution was non-negotiable, echoing Kathmandu Mayor Balendra Shah, a leading figure in the movement. Protesters had agreed on the choice of Ms. Karki only after Mr. Shah endorsed her. As young campaigners waited in front of the President’s Office throughout Friday (September 12, 2025), party insiders said Mr. Poudel had also consulted major political leaders, who told him that any action he took should remain within constitutional limits. The Army, the key facilitator whose presence on the streets has ensured a semblance of calm, was waiting for the process to move ahead as soon as possible and was getting exasperated as the hours passed, sources said. Though some expressed concerns that the process of appointing Ms. Karki fell outside constitutional bounds, constitutional expert Bipin Adhikari said it was “unlikely” to be challenged in court. “Given that her appointment is a remedial measure taken at a time of crisis, its legitimacy is not likely to be questioned,” said Mr. Adhikari, who is also a professor of law at Kathmandu University. “Crises have been handled in a similar way in the past as well.” Nepal’s tech-savvy Gen Z, frustrated with the political class for their years of misrule and flashy, luxurious lifestyles, hit the streets. At least 19 people were killed in a brutal response by the Oli government on Monday (September 8, 2025), which triggered further protests and a sweeping social media ban. On Tuesday (September 9, 2025), the protests turned violent, as demonstrators stormed politicians’ homes, set them on fire, and manhandled them. They also burnt down key government infrastructure — the Supreme Court, Parliament, and Singha Durbar, the seat of the government — in a symbolic takeover of the state. From Discord to Bitchat, tech at the heart of Nepal protests Nepal protests: It’s Gen Z vs ‘nepo kids’ Watch: The rise and fall of K.P. Sharma Oli: Nepal’s embattled leader As the protests escalated, Mr. Oli stepped down and has been under Army protection since. After much deliberation, the campaigners locked in Ms. Karki’s name to lead a civilian government to clean up the mess created by political parties and lead the country forward. Now that Ms. Karki has been given the helm of the country, a daunting task rests on her shoulders — staying true to the demands of Gen Z and overseeing elections to hand over power to a newly elected democratic government. Ms. Karki is widely regarded as clean and upright, with many even calling her an anti-corruption crusader. She holds a master’s degree in political science from Banaras Hindu University, Varanasi, and a law degree from Tribhuvan University. After serving as Acting Chief Justice from April 13 to July 10, 2016, she was appointed Chief Justice on July 11, 2016. She retired on June 7, 2017. Lok Raj Baral, a professor and former Ambassador of Nepal to India, says that in the current context, the selection of Ms. Karki is wholly justified. “The immediate challenges for her would be to maintain law and order, boost confidence among all organs of the state, and oversee elections,” said Mr. Baral, author of Nepal: From Monarchy to Republic, in an interview with The Hindu. “With her clean image and upright personality, I believe she will be able to carry out the task of peacefully handing over power.” After assuming office, Ms. Karki will need to form a Cabinet by appointing Ministers to carry out essential functions of government while leading the country toward elections. ALSO WATCH  Watch: Nepal protests force government out | Should India worry? Mr. Adhikari says the first two priorities of the interim government should be an independent investigation and prosecution of those responsible for the September 8 carnage, and a criminal investigation into those who carried out attacks and arson against state infrastructure. “The interim head also needs to pave the way for constitutional reforms to strengthen democracy and accountability,” he added. The Ministry of External Affairs released a statement, welcoming the formation of Nepal’s new interim government. “We welcome the formation of a new Interim Government in Nepal, led by Right Honourable Mrs. Sushila Karki. We are hopeful that this would help in fostering peace and stability,” the statement read. “As a close neighbour, a fellow democracy and a long term development partner, India will continue to work closely with Nepal for the well-being and prosperity of our two peoples and countries,” it said. Published - September 12, 2025 10:39 pm IST Nepal Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-41",
    "text": "Death toll from Indonesia flooding rises to 23. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Published - September 12, 2025 09:18 pm IST - Denpasar Men inspect the damage following a flood in Badung, Bali, Indonesia, on Friday, Sept. 12, 2025.\n                                          | Photo Credit: AP The death toll from the flooding that struck two Indonesian islands, including tourist hotspot Bali, rose to 23 on Friday (September 12, 2025), officials said, with five other people still missing. Also Read | Landslides, flash floods on Indonesia’s Java island leave 17 dead, 8 missing Torrential rain late Tuesday triggered floods and landslides across Bali, the National Disaster Mitigation Agency (BNPB) said, adding four more people have been found dead and two others are unaccounted for. The additional deaths come on top of 14 already reported on Bali and five on the island of Flores. BNPB chief Suharyanto, who like many Indonesians goes by one name, said the agency had distributed aid including food, clothes and beds. He estimated losses from the disaster reached around 25 billion rupiah ($1.52 million). Flash flooding on Monday struck the Nagekeo district of Flores island, where authorities' efforts to search three missing victims have been hampered by debris. The annual monsoon season in Indonesia, typically between November and April, often brings landslips, flash floods and water-borne diseases. Climate change has affected storm patterns, including the length and severity of the season, leading to heavier rain, flash flooding and stronger wind gusts. Floods and landslips on Java island in March killed three people and left five others missing after heavy rain inundated two dozen towns. In January, at least 25 people were killed when floods and landslips hit a town in Central Java. Published - September 12, 2025 09:18 pm IST avalanche/landslide\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        Indonesia Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-42",
    "text": "France demands release of citizens held in Iran after Tehran floats prisoner swap. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Published - September 12, 2025 09:12 pm IST - PARIS A woman walks past posters with the portraits of Cecile Kohler and Jacques Paris, two French citizens held in Iran, on the day of support rallies to mark their three-year detention and to demand their release, in front of the National Assembly in Paris, France, May 7, 2025. \n                                          | Photo Credit: Reuters France reiterated its demands on Friday (September 12, 2025) for the immediate, unconditional release of three French citizens held in Iran, declining to comment on a possible prisoner swap mentioned this week by the Iranian Foreign Minister. Iran has been holding Cecile Kohler and her partner, Jacques Paris, since 2022 in conditions that France has said are akin to torture. An 18-year-old French-German cyclist was also arrested in July. In comments earlier this week, Iranian Foreign Minister Abbas Araqchi suggested the French nationals could be exchanged for Mahdieh Esfandiari, an Iranian student living in the French city of Lyon who was arrested this year over anti-Israel social media posts. \"A lot of work has been done regarding Ms Esfandiari's case, and exchanging of her for French prisoners in Iran. We hope that good news will be announced on this matter soon,\" Mr. Araqchi told Iranian state television. Asked about Mr. Araqchi's statement, outgoing French Foreign Minister Jean-Noel Barrot declined to comment. \"France demands the unconditional and immediate release of our citizens in Iran, and I will make no comment on the remarks of the Iranian foreign minister,\" Mr. Barrot told France Inter radio. Ms. Kohler and Mr. Paris are accused of spying and seeking to stir up unrest, charges that France has called baseless. Negotiations to secure their release have been ongoing for months, and the French government has become increasingly frustrated by the lack of progress or access to its citizens. It has filed a complaint at the World Court against Iran for violating the right to consular protection. Efforts to reach a deal about the prisoners are likely to be complicated after France, Britain and Germany triggered the process to reimpose sanctions on Iran at the U.N. in August. Iran's Revolutionary Guards have detained dozens of foreign and dual nationals in recent years, often on espionage-related charges. Rights groups and Western countries accuse Tehran of using foreign detainees as bargaining chips, which it denies. Published - September 12, 2025 09:12 pm IST France\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        international relations Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-43",
    "text": "Who is Sushila Karki, Nepal’s new interim head  \nPremium. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Updated  - September 13, 2025 02:05 am IST Nepal’s former Chief Justice Sushila Karki. File.\n                                          | Photo Credit: Reuters In 2016, Sushila Karki ascended to the position of Chief Justice of the Nepal Supreme Court, making her the first woman to be appointed to that position. Her appointment came following a recommendation by the Constitutional Council, which was headed by then Prime Minister K.P. Sharma Oli. Now, nine years later, Ms. Karki has taken over the reins of Nepal as its interim head, following Mr. Oli’s resignation, as the country gathers itself following days of bloody protests. At least 51 people were killed after Gen-Z-led protestors clashed with security forces while rallying on streets demanding an end to Mr. Oli’s regime. Though the demonstration came at the heels of a controversial blanket social media ban, it signalled more serious concerns plaguing the Nepali political class. Prior to the ban, social media sites had emerged as the centre of a digital movement of sorts criticising children of the ruling political class — “nepo kids”, who were leading lavish lifestyles while youth back home dealt with misgovernance. Holding banners of “Youth against corruption”, the young protestors took to the streets demanding an end to corruption and favouritism. In Focus Podcast | Nepal on the Brink - Part 2: Beyond the Gen Z’s rage Their demonstrations yielded a reversal of the social media ban, and brought about quick resignations of the country’s Home Minister as well as Prime Minister Oli. What has been described as a movement not aligned to any political party, managed to get this far without a visible singular leader. At the end of two violent days, this vacuum of power extended to the country’s top leadership. With outrage giving way to desired results, it was time for the Nepali youth to now look for solutions. Sushila Karki’s name was quick to gain traction as online spaces, now restored, hosted discussions and polls to decide on who best would embody Gen-Z protestors demands. Ms. Karki’s year-long stint as the Chief Justice was a reason many gave for backing her. Also read | From Discord to Bitchat, tech at the heart of Nepal protests Born in Nepal’s Biratnagar in 1952, Ms. Karki completed her higher education from Tribhuvan University before she came to India. At the Banaras Hindu University, Ms. Karki pursued a Masters degree in Political Science. Later she returned to Kathmandu to get her Bachelor’s degree in Law from the Tribhuvan University. She is married to Durga Subedi, who was a youth leader in the Nepali Congress party Ms. Karki began her professional journey as a teacher, before pivoting to law and by 2004 was a Senior Advocate in the Nepal Bar Association. From November 2010, Ms. Karki was appointed as Permanent Justice in the Nepal Supreme Court and was elevated to the court’s highest position in July 2016. Ms. Karki served as Nepal Supreme Court’s Chief Justice for a year and was set to retire in 2017. However, just one month prior to her retirement Ms. Karki was suspended after an impeachment motion was introduced in Nepal’s Parliament accusing her of delivering biased judgments and interfering with executive powers. The motion was led by the two strongest parties in the coalition at the time -- the Communist Party of Nepal (Maoist-Centre) led by the then Prime Minister Pushpa Kamal Dahal and the Nepali Congress of Sher Bahadur Deuba. However, an intervention by the Supreme Court led to her eventual re-instatement. Ms. Karki’s tenure in Nepal’s Supreme Court, and later as Chief Justice was marked by politically sensitive and socially transformative judgments including one that banned commercial surrogacy in favour of altruistic one. Ms. Karki in 2012 was also part of the bench that had convicted then incumbent Minister of Information J.P. Gupta of corruption. The impeachment proceedings against Ms. Karki were largely seen as a response to her ordering the government to revoke the appointment of Jaya Bahadur Chand as Nepal’s Police Chief. Even just a day before impeachment proceedings were introduced against her, Ms. Karki convicted three former Inspectors General of Nepal Police in a multimillion dollar scam case. Ms. Karki’s professional past has served as a confidence booster for Nepal’s youth seeking cleaner politics moving forward. However, the former Chief Justice will have to navigate a landscape still in disagreement.  Ms. Karki’s primary responsibility will also entail conducting free and fair elections in the country. In the past, Ms. Karki’s judgments shaped Nepal’s socio-political temperament. The retired jurist now will have to navigate Nepal’s future by banking upon her experiences. Published - September 12, 2025 07:45 pm IST Nepal\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        The Hindu Profiles Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-44",
    "text": "U.S. President Trump says his patience with Putin is running out. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Published - September 12, 2025 07:23 pm IST - NEW YORK U.S. President Donald Trump. File \n                                          | Photo Credit: Reuters U.S. President Donald Trump on Friday (September 12, 2025) said his patience with Russian President Vladimir Putin was running out, but stopped short of threatening new sanctions over the Ukraine war. Asked if his patience with Mr. Putin had run out, Mr. Trump said: \"Yeah. It's sort of running out and running out fast.\" In an interview with Fox News, Mr. Trump said he had long had a good relationship with Mr. Putin, but expressed frustration at his failure to end the war. \"We're going to have to come down very, very strong,\" he said. Trump said sanctions on banks and oil were an option, along with tariffs, but European countries also needed to participate. Also Read | ‘More’ secondary sanctions on countries buying Russian oil can damage Moscow’s economy: U.S. Treasury chief \"But I've already done it. I've done a lot,\" Mr. Trump said, noting that India — one of the biggest buyers of Russian oil — was facing a 50% tariff on its exports to the U.S. \"That's not an easy thing to do. That's a big deal, and it causes a rift with India,\" he told the \"Fox & Friends\" program. \"And remember this, this is a Europe problem, much more than our problem.\" Published - September 12, 2025 07:23 pm IST USA\n                    \n                            /                      \n                        \n                        Donald Trump Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-45",
    "text": "Boat capsizes in Congo, killing at least 86, most of them students. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Updated  - September 12, 2025 07:19 pm IST - KINSHASA Google Maps image locates Basankusu territory in the Democratic Republic of congo. At least 86 people have died after a motorised boat capsized in northwestern Congo’s Equateur Province, state media reported on Friday (September 12, 2025). The accident occurred on Wednesday (September 10, 2025) in Basankusu territory, according to the state news agency, which also reported that most of the victims were students. It was not immediately clear what caused the accident although the state media blamed it on “improper loading and night navigation”. Published - September 12, 2025 07:00 pm IST Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-46",
    "text": "Russia says Ukraine talks are paused, accuses Europe of hindering them. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Published - September 12, 2025 06:02 pm IST - MOSCOW Russian President Vladimir Putin. File \n                                          | Photo Credit: AP The Kremlin said on Friday (September 12, 2025) that there was a pause in peace negotiations between Russia and Ukraine and accused European countries of hindering a process it said that Moscow remained open to. Russian and Ukrainian negotiators have held three rounds of direct talks this year in Istanbul, most recently on July 23, which have yielded several agreements to return prisoners of war and the bodies of the dead. But the two sides remain far apart on what a possible peace deal might look like. Russia accuses Kyiv of not recognising what it calls \"the realities on the ground\", while Ukraine says Moscow is feigning interest in talks while continuing to try to take more of its territory. Efforts by U.S. President Donald Trump to broker a deal have so far come to nothing. Asked whether talks between Kyiv and Moscow were now deadlocked, Kremlin spokesman Dmitry Peskov said: \"The channels of communication are in place and functioning. Our negotiators have the opportunity to communicate through these channels. But for now, it is probably more accurate to say that there is a pause.\" Moscow has bridled against proposals by European countries and Britain to provide security guarantees to Ukraine that might involve deploying NATO troops on the ground after any peace settlement, saying it could not accept such a move. Peskov blamed the pause in talks on such ideas. \"The Russian side remains ready to pursue the path of peaceful dialogue. But the fact that the Europeans are hindering this is indeed true. This is not a secret to anyone,\" he said. Published - September 12, 2025 06:02 pm IST Russia\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-47",
    "text": "Charlie Kirk shooting suspect arrested. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Updated  - September 12, 2025 09:10 pm IST - Orem, U.S. Photo released by the Utah Department of Public Safety on September 12, 2025 shows a police mugshot of Tyler Robinson, the suspect in the fatal shooting of U.S. conservative commentator Charlie Kirk during an event at Utah Valley University, in Orem, Utah, U.S. Photo: Utah Department of Public Safety via Reuters U.S. authorities said on Friday (September 12, 2025) they had captured the man accused of killing prominent right-wing activist Charlie Kirk after a family member helped to turn him in after a frantic manhunt. “We got him,” Utah Governor Spencer Cox told a press conference. Mr. Cox identified the suspect as Tyler Robinson and said the arrest was made after one of Mr. Robinson’s relatives contacted a friend, who then contacted the police. The arrest raised a bitterly divided country’s hopes of finding answers to the shocking political murder on Wednesday (September 10, 2025). The 31-year-old was killed after being hit by a single bullet in his neck while addressing a large crowd at Utah Valley University. Kirk was an electrifying presence on the U.S. far-right, with a talent for debate and a huge following that helped U.S. President Donald Trump build the youth vote in his election victory in November 2024. From the moment of the shooting, Mr. Trump has treated the event as a matter of top national importance. Mr. Trump first announced that Kirk had died from his wound, and on Friday (September 12, 2025) it was Mr. Trump again who took to Fox News — ahead of the press conference by law enforcement — to say that the main suspect was in custody. The Republican President has ordered flags at half-mast and said he will attend Kirk’s funeral. Authorities quickly found the alleged murder weapon, a high-powered hunting rifle, and released photos of a young man dressed in a baseball cap and casual clothing. However, after detaining, then releasing, two people who turned out to be unconnected to the case, the police and FBI appeared to struggle. Late on Thursday (September 11, 2025), officials in Orem released more details about the suspect’s clothing and initial movements after the shooting, pleading with the public to help identify him. FBI Director Kash Patel said the arrest was finally made at 10 p.m. local time Thursday (September 11, 2025) — 33 hours after the shooting. Mr. Cox credited assistance from the alleged killer’s own family. “On the evening of September 11th, a family member of Tyler Robinson reached out to a family friend, who contacted the Washington County sheriff’s office with information that Robinson had confessed to them or implied that he had committed the incident,” he said. Mr. Cox said his state would pursue the death penalty against the suspect. Mr. Trump said he would back such a move. “I hope he gets the death penalty,” he told Fox News. Reflecting the highly political nature of the killing, Kirk’s coffin was transported to his home city of Phoenix on Vice-President J.D. Vance’s official plane. Footage showed Mr. Vance with his hands on the casket as it was carried to Air Force 2. Kirk, whom supporters have hailed as a “martyr,” co-founded Turning Point USA in 2012 to drive conservative viewpoints among young people, with his natural showmanship making him a go-to spokesman on television networks. The father-of-two used his audiences on TikTok, Instagram and YouTube to build support for anti-immigration policies, outspoken Christianity and gun ownership, and to spread carefully edited clips of his interactions during debates at his many college events. Published - September 12, 2025 05:56 pm IST USA\n                    \n                            /                      \n                        \n                        crime Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-48",
    "text": "China’s newest aircraft carrier sails through Taiwan Strait for the first time. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Published - September 12, 2025 02:21 pm IST - BEIJING This handout photo taken by Japan’s Ministry of Defence on September 11, 2025 and received via Jiji Press on September 12, 2025 shows China’s third and newest aircraft carrier, the Fujian, sailing in the East China Sea. \n                                          | Photo Credit: AFP China's newest aircraft carrier has sailed through the Taiwan Strait, the navy said on Friday (September 12, 2025). The body of water separates China from Taiwan, the self-governing island that Beijing says must come under its control. The sailing could serve as a warning to the U.S. and others against support for Taiwan, though China played down any such motive. The Fujian, which is doing sea trials ahead of its commissioning, was heading to the South China Sea to conduct training and scientific experiments, the Navy said in a short post on social media. The Navy said the carrier's activities were not targeting anyone else. A social media account affiliated with state media quoted an expert saying the Taiwan Strait was the normal and most reasonable and efficient route for the carrier to reach the South China Sea. It was the first time the Fujian had passed through the strait, the post by the Yuyuantantian account said. The U.S. Navy sends warships through the strait periodically, as do some of its allies, in a warning to Beijing against any attempt to use force to establish its claim to the island. Taiwan and China split in the civil war that brought the communists to power in 1949. The defeated Nationalist government fled to Taiwan and set up its own government on the island. The U.S. does not officially recognize the government in Taiwan, but it provides weaponry for its defence and says that any resolution of the differences between China and Taiwan should be peaceful and not by military force. China's military said last week that it was on high alert after the Canadian frigate Quebec and the Australian destroyer Brisbane sailed through the strait. It accused the two warships of provocative actions that it said heightened security risks. Japan's military said it had spotted the China's latest carrier for the first time on Thursday afternoon. The Fujian, together with two guided-missile destroyers, was sailing southwest about 200 kilometres (125 miles) from the disputed Senkaku islands, or the Diaoyu islands in Chinese. Both countries claim the remote and uninhabited territory. The carrier's heading at the time was on a course for the Taiwan Strait. Published - September 12, 2025 02:21 pm IST China\n                    \n                            /                      \n                        \n                        Taiwan Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-49",
    "text": "U.K.'s Prince Harry makes surprise Ukraine visit with rehabilitation charity. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Published - September 12, 2025 01:20 pm IST - LONDON Representational image of Britain’s Prince Harry in London\n                                          | Photo Credit: AP Britain's Prince Harry visited Ukraine on Friday (September 12, 2025), arriving in Kyiv with a team from his Invictus Games Foundation to detail his charity's plans to help rehabilitate wounded soldiers, the Guardian newspaper reported. It is the second visit Harry, the younger son of Britain's King Charles, has made to Ukraine this year, after he visited a centre for wounded military personnel in Lviv in April. Harry served for 10 years in the British Army before setting up the Invictus Games Foundation, a charity which runs an international sporting event for military personnel wounded in action. \"We cannot stop the war but what we can do is do everything we can to help the recovery process,\" Harry told the Guardian on an overnight train to Kyiv. He was invited to the capital by the Ukrainian government, he said, and received permission from the British government and his wife before travelling. The trip comes at the end of Harry's four-day visit to Britain from his home in California, where he lives with his wife Meghan and their two children. Since he stepped down as a senior royal in 2020, Harry's relationship with his father has been strained after he publicly criticised the royal family. In a sign of a thaw in relations, the pair held their first meeting in 20 months on Wednesday. Published - September 12, 2025 01:20 pm IST United Kingdom\n                    \n                            /                      \n                        \n                        Ukraine Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-50",
    "text": "South Korean workers detained in U.S. head home as Seoul seeks support for new visa. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Published - September 12, 2025 12:50 pm IST - SEOUL South Korean workers who were detained in a huge immigration raid last week at the site of a U.S. car battery project involving Hyundai Motor and LG Energy Solution in the U.S. state of Georgia, arrive at the Incheon International Airport in Incheon, South Korea, September 12, 2025.  \n                                          | Photo Credit: Reuters South Korean Foreign Minister Cho Hyun has urged the U.S. Congress to support a new visa for his country's businesses, as hundreds of mainly Korean workers arrested during a massive U.S. immigration raid last week were set to return home on Friday (September 12, 2025). “During his meetings with U.S. senators in Washington, Mr. Cho reiterated concerns among South Koreans over the detention of Korean professionals participating in investment projects in the United States,” his Ministry said in a statement. A plane carrying more than 300 Korean workers who were detained during the raid at a Hyundai Motor and LG Energy Solution battery joint venture in the state of Georgia has left the United States, bound for South Korea. The plane is expected to touch down in South Korea at around 2 p.m. (0500 GMT), according to LG Energy Solution, whose workers and subcontractors were among the detainees. After being held for a week by U.S. Immigration and Customs Enforcement, the South Korean workers have been released and flown from Atlanta. The raid that sent shockwaves across South Korea has threatened to destabilise ties, at a time when both countries are seeking to finalise a trade deal, and to scare off South Korean investment in the United States that U.S. President Donald Trump has been keen to secure. “Following the raid, the battery plant is facing a minimum startup delay of two to three months,” Hyundai CEO Jose Munoz said on Thursday (September 11, 2025). “In the wake of the raid, Washington and Seoul have agreed to discuss establishing a new visa category for South Koreans,” Mr. Cho has said. U.S. Commerce Secretary Howard Lutnick said on Thursday (September 11, 2025) that hundreds of South Korean workers arrested during the immigration raid had the wrong visas. \"I called up the Koreans, I said, oh, give me a break. Get the right visa and if you're having problems getting the right visa, call me,\" Mr. Lutnick said in an interview with Axios. Asked if the raid had created tensions between the countries, Mr. Lutnick told CNBC Trump would \"go and address that.\" \"So I think he's going to make a deal with different countries that when they want to build big here, he'll find a way to get their workers proper work visas, meaning short-term work visas, train Americans and then head home,\" he said. South Korean companies have complained for years that they have struggled to obtain short-term work visas for specialists needed at their high-tech U.S. plants, and had come to rely on a grey zone of looser interpretation of visa rules under previous U.S. administrations. \"Minister Cho emphasised that fundamental preventative measures are essential to ensure that our workforce is not subjected to unfair treatment in order to fulfil our companies' investment commitments to the United States,\" the Ministry said in a statement. Published - September 12, 2025 12:50 pm IST South Korea\n                    \n                            /                      \n                        \n                        politics (general)\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        international relations\n                    \n                            /                      \n                        \n                        politics Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-51",
    "text": "Russia and Belarus start military exercise near NATO border after drone incursion. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Updated  - September 12, 2025 05:23 pm IST - MOSCOW Russian and Belarus began a major joint military exercise on NATO’s doorstep on Friday, September 12, 2025.\n                                          | Photo Credit: Reuters Russia and Belarus began a major joint military exercise on NATO's doorstep on Friday (September 12, 2025) that will involve drills in both countries and in the Baltic and Barents seas, the Russian Defence Ministry said. The \"Zapad-2025\" exercise - a show of force by Russia and its close ally - is taking place at an exceptionally tense moment in the Russia-Ukraine war, two days after Poland, with support from its NATO allies, shot down suspected Russian drones over its airspace. The Zapad (\"West\") exercise was scheduled well before the drone incident, for which Russia denied responsibility. \"The objectives of the drills are to improve the skills of commanders and staffs, the level of co-operation and field training of regional and coalition groupings of troops,\" the Defence Ministry said on Telegram. In a first stage, troops will simulate repelling an attack against Russia and Belarus, whose alliance is known as the Union State. The second stage will focus on \"restoring the territorial integrity of the Union State and crushing the enemy, including with the participation of a coalition group of forces from friendly states,\" the Ministry said. Kremlin spokesman Dmitry Peskov said on Thursday (September 11, 2025) that the drills, including near the Polish border, were not aimed against any other country. But this week's drone incident over Poland was seen in the West as an alarm call for NATO and a test of its responses. Western countries called it a deliberate provocation by Russia, which Moscow denied. A senior Russian diplomat in Poland said the drones had come from the direction of Ukraine. Russia's Defence Ministry said its drones had carried out an attack in western Ukraine, but it had not planned to hit any targets in Poland. U.S. President Donald Trump said Russia's drone incursion into Poland could have been a mistake. \"I'm not happy about anything to do with the whole situation, but hopefully that's going to come to an end,\" Mr. Trump told reporters before boarding Marine One on Thursday (September 11, 2025). Even before the incident, Polish Prime Minister Donald Tusk had described the upcoming \"Zapad\" manoeuvres as \"very aggressive\" and announced that Poland would close its border with Belarus at midnight on Thursday (September 11, 2025). Belarus also shares borders with NATO members Lithuania and Latvia. Lithuania said it was protecting its border because of the military exercise. Published - September 12, 2025 12:38 pm IST Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Russia Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-52",
    "text": "Nepal unrest highlights: Dalai Lama congratulates Sushila Karki; curfew lifted from Kathmandu Valley, other areas as life returns to normal. September 13, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 13, 2025e-Paper Updated  - September 13, 2025 09:38 pm IST Newly sworn-in Nepal’s interim Prime Minister, Sushila Karki, arrives at a hospital to meet the victims of the deadly anti-corruption protests, in Kathmandu, Nepal, on September 13, 2025.\n                                                  | Photo Credit:  \n                          Reuters Nepal authorities on Saturday (September 13, 2025) lifted the curfew and restrictive orders imposed in Kathmandu Valley and other parts of Nepal, allowing daily life to return to normal gradually. The development came a day after former Chief Justice Sushila Karki on Friday became Nepal’s first woman prime minister to lead an interim government, ending days of political uncertainty after the K.P. Sharma Oli dispensation was forced to quit in the face of a nationwide agitation triggered by a social media ban. In Focus Podcast | Nepal on the Brink - Part 2: Beyond the Gen Z’s rage President Ram Chandra Paudel administered the oath of office to Ms. Karki (73) at the President’s Office. “Congratulations! We wish you success, wish the country success,” President Paudel said to Karki after the swearing in ceremony broadcast on state television. Mr. Poudel announced that the elections of the House of Representatives will be held in six months. Follow the live updates here: Sri Lankan President Anura Kumara Dissanayake on Saturday congratulated Nepal’s newly-appointed prime minister Sushila Karki who took over as the head of the interim government following a week of violent protests. “I convey my warmest congratulations and best wishes to Mrs. Sushila Karki on her assumption of the Premiership of Nepal’s interim government,” Dissanayake said. “We are confident that her leadership will guide Nepal towards a smooth return to lasting peace and democracy,” the statement added. -                PTI The Sashastra Seema Bal (SSB) has apprehended two Nigerians and a Brazilian national who are suspected to have escaped from jails in Nepal during the recent anti-government protests, officials said on Saturday. The force guarding the India-Nepal international border and the state police have caught more than 75 people from various locations along this 1,751-km-long unfenced front till now, they said. They include two Nigerian nationals, a Brazilian, a Bangladesh citizen and some Indians. These people have been caught from the border over the last three-four days after they escaped from various jails following the massive anti-government protests in the neighbouring country, according to the officials. Out of them, about 43 people have been caught from along the international border in Bihar, 22 from Uttar Pradesh, 8 from Uttarakhand and 2 from West Bengal, the officials said. -                PTI In his first reference to Nepal after the recent violent unrest in the Himalayan nation, Uttar Pradesh Chief Minister Yogi Adityanath on Saturday emphasised that small things, if neglected, can turn into bigger problems, as was visible in the neighbouring country, saying issues must be addressed proactively with sensitivity. Addressing an event here, Adityanath said public representatives also face people’s anger and they need to patiently hear their grievances and address them rationally. -                PTI Prime Minister Narendra Modi congratulated Nepal’s interim PM Sushila Karki on assuming office, calling her appointment “a shining example of women empowerment.” Addressing a rally in the Manipur capital, Modi said, “I want to congratulate Karki on behalf of 140 crore Indians.” Former Chief Justice Sushila Karki on Friday night became Nepal’s first woman prime minister to lead an interim government. He added, “Karki occupying the top post of that country is an example of women’s empowerment. I am confident that she will pave the way for peace, stability, and prosperity in Nepal.” Her appointment ended days of political uncertainty after the K P Sharma Oli dispensation was forced to quit in the face of a nationwide agitation triggered by a social media ban. -                PTI “The Sashastra Seema Bal (SSB) has nabbed 75 inmates so far who were attempting to cross into India from Nepal from various checkpoints,” officials said. As per the officials, SSB has so far apprehended 75 inmates, while they were attempting to cross into India through various checkpoints along the India-Nepal border after fleeing jails in Nepal amid the ongoing unrest in the Himalayan nation. The SSB, one of the Central Armed Police Forces under the Ministry of Home Affairs, which is tasked with guarding India’s 1,751-km-long open border with Nepal and the 699-km stretch along Bhutan, is vigilant since unrest following ‘Gen-Z’ led protests across Nepal. India and Nepal share a 1,751 km long border (across five Indian States of Sikkim, West Bengal, Bihar, Uttar Pradesh and Uttarakhand). -                 ANI Tibetan spiritual leader Dalai Lama extended congratulations to Sushila Karki upon her appointment as the interim Prime Minister of Nepal. In a message shared by his office, Dalai Lama said, “As you know, the Nepalese and Tibetan peoples have historically enjoyed a close relationship,” he wrote. “I am very grateful to the government and the people of Nepal for providing facilities for the rehabilitation of Tibetan refugees following their forced escape from Tibet after 1959. Indeed, although the Tibetan community is relatively small, I believe it has been making a notable contribution towards Nepal’s economic growth.” In his remarks, Dalai Lama said, “I wish you every success in fulfilling the hopes and aspirations of the people of Nepal in these challenging times. With my prayers and good wishes.” -                 ANI Nepal’s major political parties and apex lawyers’ body have strongly criticised the President’s decision to dissolve Parliament, describing the move as “unconstitutional”, “arbitrary” and a serious blow to democracy. Political parties across the spectrum slammed the dissolution move. Disapproving of the move, Nepali Congress (NC), the largest political party of the country, warned that any action violating the Constitution would be unacceptable. NC general secretary Bishwa Prakash Sharma said any breach of the Constitution raises serious questions. CPN-UML General Secretary Shankar Pokharel described the move as “ironically concerning”. The CPN (Maoist Centre) also expressed serious disagreement with the decision to dissolve the House of Representatives. -                 PTI West Bengal CM Mamata Banerjee congratulated Sushila Karki on taking oath as the Prime Minister of an interim government in Nepal, and said she looks forward to nurturing the deep-rooted ties of friendship and cooperation as the neighbour of the Himalayan country. Ms. Karki, former Chief Justice of Nepal, on Friday night (September 12, 2025) became the country’s first woman Prime Minister to lead an interim government, ending days of political uncertainty after the K.P. Sharma Oli dispensation was forced to quit in the face of a nationwide agitation triggered by a social media ban. “I extend my best wishes to the Right Honourable Mrs. Sushila Karki on her assumption of office as the Prime Minister of the Interim Government of Nepal. West Bengal has borders with Nepal, and close people-to-people relations. We look forward to nurturing of the deep-rooted ties of friendship and cooperation as neighbours.” Ms. Banerjee posted on X. -                 PTI Former Chief Justice of Nepal Sushila Karki (73) who has now become the country’s first woman Prime Minister to head an interim government, shares a strong bond with Varanasi. Ms. Karki, who described herself in a recent media interview as a “friend of India”, pursued her post-graduation from the Banaras Hindu University (BHU) in Uttar Pradesh’s Varanasi. -                 PTI Nepal’s Supreme Court has said that important documents forming part of the country’s judicial history were nearly destroyed in the recent student-led anti-government protests, even as it pledged to resume operations at the earliest. “We remain steadfast and determined on the path of justice under all circumstances,” Chief Justice Prakashman Singh Raut said in a statement on Thursday. “We pledge to resume court operations at the earliest to address citizens’ expectations of justice,” he was quoted as saying by MyRepublica news portal on Saturday. The Chief Justice expressed grief over the damage caused to court buildings due to arson, stone-pelting, vandalism and looting during the Gen-Z movement that swept across the country. Important documents integral to Nepal’s judicial history nearly destroyed in the violence, he said. Justice Raut also expressed sorrow over the deaths of Nepali citizens in the violence and conveyed condolences to the bereaved families, while wishing a speedy recovery to those injured. -                 PTI The newly appointed interim Prime Minister of Nepal, Sushila Karki, is set to formally assume charge of office on Sunday and is also likely to announce the expansion of her cabinet the same day, sources related to this development told                 ANI on Saturday. -                 ANI Kathmandu Mayor Balen Shah on Friday paid tribute to those killed in Nepal’s Gen Z protests, calling their sacrifices a turning point for the country’s future. “Dear Gen Z, Your contributions and sacrifices have brought change to the country. Heartfelt tribute to the brave martyrs. Your contributions are invaluable, which will forever guide future generations on the path of patriotism and duty. Infinite respect to you all. I wish a speedy recovery to the injured,” Mr. Shah wrote on social media in Nepali.-                 ANI Authorities on Saturday lifted the curfew and restrictive orders imposed in Kathmandu Valley and other parts of Nepal, allowing daily life to gradually return to normal. There are no restrictive orders or curfew on Saturday, a Nepal Army spokesperson said. Shops, grocery stores, vegetable markets and shopping malls reopened after days of closure, while traffic began to flow back on the streets. -PTI Nepal’s President Ramchandra Paudel dissolved parliament and called for fresh elections on March 5, his office said late on Friday. The announcement came just hours after Mr. Paudel appointed former Chief Justice Sushila Karki to lead the country. -Reuters PM Modi congratulated Sushila Karki on taking oath as Nepal PM, says India committed to peace, progress of people of neighbouring country. “We welcome the formation of a new Interim Government in Nepal, led by Right Honourable Mrs. Sushila Karki. We are hopeful that this would help in fostering peace and stability,” the Ministry of External Affairs said in a statement. “As a close neighbour, a fellow democracy and a long term development partner, India will continue to work closely with Nepal for the well-being and prosperity of our two peoples and countries,” the statement added. Nepal’s former Chief Justice Sushila Karki was sworn in to lead the transition as the country’s next Prime Minister on Friday (September 12, 2025). Nepal’s President Ram Chandra Poudel appointed Ms. Karki as the head of the interim government, with the task of holding elections to the House of Representatives within six months. -                 Sanjeev Satgainya Sushila Karki’s tenure in Nepal’s Supreme Court, and later as Chief Justice, was marked by politically sensitive and socially transformative judgments. In 2016, Sushila Karki ascended to the position of Chief Justice of the Nepal Supreme Court, making her the first woman to be appointed to that position. Her appointment came following a recommendation by the Constitutional Council, which was headed by then Prime Minister K.P. Sharma Oli. Now, nine years later, Ms. Karki is poised to take over the reins of Nepal as its interim head, following Mr. Oli’s resignation, as the country gathers itself following days of bloody protests. Read the full story below Sushila Karki, Nepal's first female Chief Justice, poised to lead country after protests against corruption and nepotism. Nepal President Ram Chandra Poudel, former Chief Justice Sushila Karki and representatives of youth campaigners have reached an agreement to appoint Ms. Karki as head of the new interim government. The deal was reached after President Poudel agreed to dissolve the House, in line with the youth campaigners’ demand, before Ms. Karki’s appointment, sources at the President’s office said. Ms. Karki will take the oath later this evening. -                 Sanjeev Satgainya The Speaker of Nepal’s House of Representatives Devaraj Ghimire and Chairman of the National Assembly Narayan Dahal on Friday (September 12, 2025) called for resolving the ongoing political deadlock within the framework of the Constitution, according to media reports. A joint statement by Ghimire and Dahal comes on a day when a crucial meeting is being held at the President’s Office at Sheetal Niwas to decide who will head the interim government following the ouster of prime minister K.P. Sharma Oli on Tuesday (September 9, 2025) after a violent student-led protest. “President Ramchandra Paudel is taking initiatives to address the situation while respecting the people’s sovereignty, civil liberties, territorial integrity, national unity, and independence,” the joint statement said. Former President Ram Baran Yadav has said that the aspirations and goals of the Gen Z generation can be fulfilled by remaining within the framework of the existing Constitution. Issuing a statement on Friday (September 12, 2025), the first President of Nepal stressed that there should be no further delay in ensuring the safety of every citizen’s life and property and in steering the country toward order and good governance. “It is my belief that the aspirations and objectives of Gen Z can be achieved through the proper implementation of Nepal’s Constitution of 2015, which was drafted by a democratically elected Constituent Assembly after nearly seven decades of dreams and the sacrifice of hundreds of martyrs,” Dr. Yadav said in the statement. At least 51 people, including an Indian national, have died in the recent ‘Gen Z’ protest that erupted across Nepal against corruption and a ban on social media sites, police said on Friday. Senior Superintendent of Police Ramesh Thapa, who is co-spokesperson for Nepal police, said the casualties include one Indian national, three policemen and other Nepali citizens, The Kathmandu Post newspaper reported. At least 36 bodies are at Tribhuvan University Teaching Hospital, Maharajgunj, where post-mortems began on Friday, it said. Police said 17 bodies were recovered from different parts of the country on Thursday and Friday. The bus service operated by the Delhi Transport Corporation (DTC) that runs between Delhi and Kathmandu has been stuck in Nepal due to the ongoing turmoil in the neighbouring country, officials said. “The bus is stuck in Nepal. The Delhi government is coordinating with the embassies of Nepal and India in the matter,” an official said on Thursday. The student-led ‘Gen Z’ protests in Nepal that began against a government ban on social media expanded into a larger campaign reflecting growing public criticism of the K P Sharma Oli dispensation and the country’s political elite over alleged corruption and apathy towards the people. The Nakkhu Prison Administration has called on all inmates (both detainees and convicts) who escaped on September 9 — the second day of youth-led protests against corruption — to surrender. This is the same prison which had handed over Rastriya Swatantra Party (RSP) Chief Rabi Lamichhane to his family’s custody. Lamichhane, facing trial for embezzling cooperative funds, was brought to Nakkhu Jail, on the outskirts of Kathmandu, from Rupandehi, a district about 270 km southwest of Kathmandu. Issuing a public appeal, the prison administration warned that staying on the run and avoiding legal processes would harm the escapees. On September 9, as protests turned violent, prison authorities “released” Lamichhane citing security concerns. Soon after, more than 3,000 inmates escaped. The prison administration said in its statement, “We request all parties to assist in facilitating the surrender of the escapees, as an expression of respect for due process, the law, and social responsibility.” More than 12,500 prisoners are reported to have escaped from jails across the country during the Gen Z protests in which, according to updated figures, 51 people died. The turmoil in Nepal has forced the organisers to drop Kathmandu as neutral venue for the inaugural women’s T20 World Cup Cricket for the Blind to be held in India in November this year and an alternate venue is being figured to host matches involving Pakistan. The tournament will be held from November 11 to 25, featuring Australia, England, India, Nepal, Pakistan, Sri Lanka, and the USA. The tournament will be played in New Delhi and Bengaluru primarily but Pakistan will be stationed at a neutral venue, which was to be Kathmandu originally. “Kathmandu was originally identified as the third host city, with fixtures involving Pakistan scheduled there; however, due to the current situation in Nepal, an alternate venue is being considered,” the Cricket Association for the Blind In India said in a statement. A civil society alliance has alleged that a “conspiracy” is being staged “under military mediation” to restore monarchy in Nepal, even as political parleys for a transitional government continued following the fall of the K P Sharma Oli administration. The Brihat Nagarik Andolan (BNA), representing people from diverse walks of life, in a statement on Thursday, voiced concern over the Nepal Army’s growing role in national affairs after it took charge of nationwide security operations from Tuesday. The group alleged that “over the bodies of the martyrs of the Gen-Z movement, a grave reactionary conspiracy is being staged — under military mediation to restore the monarchy and to abolish secularism, federalism and the proportional inclusive system”, MyRepublica news portal reported. The Supreme Court Advocates-on-Record Association (SCAORA) on Friday expressed “deep grief and anguish” over the violent attack on Nepal’s judiciary, after protesters set ablaze part of the Supreme Court premises in Kathmandu. The SCAORA, headed by advocate Vipin Nair, issued a strongly-worded resolution saying, “While the concerns of the people are to be addressed by the Government through dialogue and democratic means, such an attack on the highest judicial institution of Nepal, which embodies and upholds the rule of law, is strongly condemned.” The statement, issued by SCAORA Secretary Nikhil Jain expressed, “deep grief and anguish” over the setting afire of the Supreme Court of Nepal, including the office of the Attorney General, resulting in the irretrievable “loss of decade-old judicial records, in a brazen act by protestors”. An Indian tourist bus returning from the Pashupatinath Temple in Kathmandu was allegedly attacked by protesters amid the ongoing unrest in Nepal, leaving several passengers injured, the bus driver has claimed. The alleged incident took place on September 9 near Sonauli on the India-Nepal border, when the agitators targeted the bus carrying 49 Indians. Stones were reportedly pelted, shattering windows and injuring passengers, including women and the aged, the driver claimed. According to reports, the local authorities admitted the injured to a hospital in Kathmandu, while the remaining passengers were flown back to India on a special plane arranged by the Indian Embassy with the help of the Nepalese government. Nepal authorities have announced temporary measures to facilitate foreign nationals stranded in the country due to the ongoing curfew in the Kathmandu Valley. According to Immigration officials, international travellers whose visas were valid through September 8 can now obtain exit permits and regularise their visas without paying additional fees, The Himalayan Times reported on Friday. The facility will be available both at immigration offices and at departure points. Authorities have also put in place arrangements for visa transfers in cases where visitors lost their passports during the disturbances. Nepal’s president and army sought on Friday to find a consensus interim leader to fill a political vacuum after deadly anti-corruption protests toppled the government and left parliament in flames. The Himalayan nation of 30 million people was plunged into chaos this week after security forces tried to crush rallies by young anti-corruption protesters, culminating in widespread violence on Tuesday. Disagreements between rival factions remain, although Sushila Karki, 73, Nepal’s first woman chief justice, is a leading candidate. “A meeting has been scheduled for this afternoon with the president, the army chief, former chief justice Sushila Karki, our representative Sudan Gurung and one legal expert,” Nimesh Shrestha, who was part of the Gen Z protest, told AFP. “Nepal attracts tourists from across the world and money flows into the country, but none of it has ever been used for the welfare of the people. There has been no change in the lives of normal people. Nepalis are forced to leave their families behind to do menial work abroad, but leaders at home live in luxury,” 21-year-old Janaki from Dolpa, Nepal, who works as a hairdresser in Bengaluru, said. As their country plunged into turmoil, Nepali migrants in Bengaluru told the                 The Hindu that the protests were long awaited. For years, they said, politicians in Nepal prospered on taxpayers’ money, while the educated youth were left without jobs, forcing many to migrate to India and other countries in search of work. Nepali migrants in Bengaluru share struggles of corruption, unemployment, and forced migration back home amid financial disruptions. Three municipal mayors from Nepal who were supposed to attend the two-day Kerala Urban Conclave that got under way in Kochi on Friday (September 12, 2025) called off their visit citing the prevailing political unrest in the wake of the countrywide agitation by Gen Z. Mayors Krishna Hari Maharjan of Tarakeshwor municipality, Bhim Prasad of Nilkantha municipality who is also the president of municipal association of Nepal, and Prahlad Sapkota of Ratnanagar municipality were scheduled to attend the conclave. Read the story here Three Nepali mayors cancel visit to Kerala Urban Conclave due to political unrest, while mayors from other countries attend. From sparking protests that toppled the prime minister to giving young people a platform to discuss their country’s political future, social media was key to Nepal’s extraordinary uprising this week. Fuelled in part by anger over flashy lifestyles flaunted by elites, young anti-corruption demonstrators mainly in their 20s rallied on Monday. The loose grouping, largely viewed as members of “Gen Z”, flooded the capital Kathmandu to demand an end to a ban on Facebook, YouTube and other popular sites. Nepal’s president and army chief will hold a key meeting Friday with the ex-chief justice tipped as a possible interim leader, as well as a leading youth activist, a protester representative said. “A meeting has been scheduled for this afternoon with the president, the army chief, former chief justice Sushila Karki, our representative Sudan Gurung and one legal expert,” Nimesh Shrestha, who was part of the Gen Z protest, told AFP. Nepal’s Gen Z campaigners have unanimously backed former Chief Justice Sushila Karki to lead as interim Prime Minister, but the formation of the interim administration has been delayed amid disagreements over whether Parliament should be dissolved. President Ram Chandra Poudel held late-night discussions with legal and constitutional experts on Thursday (September 11, 2025), in a meeting facilitated by Nepal Chief Gen. Ashok Sigdel. Mr. Poudel will continue consultations on Friday (September 11, 2025), sources confirmed. Read the story here Nepal's Gen Z supports Sushila Karki for interim PM, but delays arise over Parliament dissolution and legal process. Nepal’s police force is gradually resuming operations in the Kathmandu Valley, with police stations and posts that were vandalised or set ablaze during violent anti-government protests earlier this week slowly coming back into operation, officials said on Friday. Stations, beats and units damaged in the student-led unrest are gradually reopening, and Nepal Police and Armed Police Force personnel have reappeared on streets and around posts across the Valley, the Kathmandu Valley Police Office said. Dozens of police stations across the Valley were vandalised and damaged, though the exact number is yet to be confirmed. “Exact data on such incidents is not yet available,” SSP Shekhar Khanal, spokesperson of the Kathmandu Valley Police Office at Ranipokhari, was quoted as saying by MyRepublica news portal. At least 51 people were killed during violent anti-corruption protests in Nepal this week, police said on Friday (September 12, 2025) in an updated toll, as the full scale of chaos that toppled the government emerges. Talks continue among the President, protest representatives, key potential figures who may lead an interim administration and the army -- which has imposed a curfew and taken charge of the streets. At least 21 protesters were among those killed, mainly on Monday (September 8, 2025) during a police crackdown on demonstrations against a government ban on social media, corruption and poor governance. Read the story here Violent anti-corruption protests in Nepal leave 51 dead, government toppled, army takes control, prisoners escape. Published - September 12, 2025 12:24 pm IST Nepal\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        civil unrest\n                    \n                            /                      \n                        \n                        Live news Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-53",
    "text": "Nepal’s Gen Z campaigners back Sushila Karki for interim PM. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Updated  - September 12, 2025 12:32 pm IST - Kathmandu Nepal’s former Chief Justice Sushila Karki.\n                                          | Photo Credit: Reuters Nepal’s Gen Z campaigners have unanimously backed former Chief Justice Sushila Karki to lead as interim Prime Minister, but the formation of the interim administration has been delayed amid disagreements over whether Parliament should be dissolved. President Ram Chandra Poudel held late-night discussions with legal and constitutional experts on Thursday (September 11, 2025), in a meeting facilitated by Nepal Chief Gen. Ashok Sigdel. Mr. Poudel will continue consultations on Friday (September 11, 2025), sources confirmed. While all sides agreed late Thursday on Ms. Karki, 73, to lead the interim government, and President Poudel reportedly informed major political parties, confusion emerged over which constitutional provision should be invoked to formally appoint her, and whether Parliament should be dissolved. Political parties, which have taken a backseat following two days of massive youth-led protests against corruption, have called for a resolution within the framework of the Constitution. Meanwhile, civil society voices have grown louder, urging that no step be taken outside the constitutional ambit. One of the key demands of the protesters, however, remains the dissolution of Parliament. At least two legal experts involved in the consultations said the delay is no longer about leadership but about the legal process — specifically, whether Parliament must be dissolved to proceed. At a press conference on Thursday (September 11, 2025), Sudan Gurung, a prominent Gen Z campaigner, said the movement is not against the Constitution, but holds a firm view that Parliament must be dissolved. Published - September 12, 2025 12:08 pm IST Nepal Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-54",
    "text": "India, European Union reaffirm commitment to early conclusion of FTA talks: Piyush Goyal. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Updated  - September 12, 2025 05:20 pm IST - New Delhi Union Minister Piyush Goyal. File\n                                          | Photo Credit: ANI India and the European Union (EU) have reaffirmed their commitment to the early conclusion of ongoing Free Trade Agreement (FTA) negotiations between the two sides. In a social media post on X, Union Commerce and Industry Minister Piyush Goyal wrote that a balanced and mutually beneficial FTA will unlock new opportunities. PM Modi speaks to Italian counterpart Meloni; discusses EU-India FTA, Ukraine conflict In his X post he said, \"As the India-EU FTA negotiations continue, we reiterated our shared commitment towards its early conclusion. A balanced and mutually beneficial FTA will unlock new opportunities for people & businesses on both sides.\" European Trade Commissioner Maros Sefcovic and Commissioner for Agriculture and Food Christophe Hansen are on a visit to India from September 12-13. They will lead the negotiations on the Free-Trade Agreement (FTA) between India and the European Union. On September 9, the EU Embassy in India posted, “On 12-13 Sept, EU Trade Commissioner Maros Sefcovic and Agriculture & Food Commissioner Christophe Hansen will be in town to meet Minister Piyush Goyal, take stock & power up India-EU business ties and connect with key stakeholders.” PM Modi, European Commission Chief Von der Leyen hold talks; India, EU set year-end deadline for FTA, security and defence pact The India-European Union Free Trade Association (EFTA) Trade and Economic Partnership Agreement (TEPA) is expected to be implemented later this year, once all parties complete their ratification processes. Earlier, German Foreign Minister Johann Wadephul reaffirmed his country's commitment to finalising the Free Trade Agreement (FTA) between India and the European Union as soon as possible. During the meetings, India has emphasised that meaningful progress in trade negotiations requires equal focus on non-tariff barriers (NTBs) alongside tariff discussions and regulatory frameworks must be inclusive, proportionate, and avoid restricting trade. India, EU discuss ways to bolster collaboration on climate change, circular economy India has, over the past five years, inked several trade deals, that include the India-Mauritius Comprehensive Economic Cooperation and Partnership Agreement (CECPA) implemented in 2021, the India-UAE Comprehensive Economic Partnership Agreement (CEPA) and the India-Australia Economic Cooperation and Trade Agreement (ECTA) in 2022, the India-European Free Trade Association (EFTA) Trade and Economic Partnership Agreement (TEPA) in 2024, and the India-U.K. Comprehensive Economic and Trade Agreement (CETA) signed in 2025, which is yet to come into force. India in active dialogue with U.S. for free trade pact: Piyush Goyal The India-EFTA) Trade and the TEPA is expected to be implemented later this year once all parties complete their ratification processes. Meanwhile, India is in talks for several other agreements, including the India-EU FTA, India-Australia Comprehensive Economic Cooperation Agreement (CECA), India-Sri Lanka Economic and Technology Cooperation Agreement, India-Peru FTA, India-Chile CEPA, India-New Zealand FTA, and a bilateral trade agreement with the United States. Published - September 12, 2025 11:57 am IST New Delhi\n                    \n                            /                      \n                        \n                        Delhi\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        international relations\n                    \n                            /                      \n                        \n                        European Free Trade Association\n                    \n                            /                      \n                        \n                        national politics\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        politics (general)\n                    \n                            /                      \n                        \n                        trade agreements Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "id": "hindu-55",
    "text": "From Discord to Bitchat, tech at the heart of Nepal protests. September 12, 2025e-Paper The View From India\n\t\t\t\t\t\t\t\t\tLooking at World Affairs from the Indian perspective. First Day First Show\n\t\t\t\t\t\t\t\t\tNews and reviews from the world of cinema and streaming. Today's Cache\n\t\t\t\t\t\t\t\t\tYour download of the top 5 technology stories of the day. Science For All\n\t\t\t\t\t\t\t\t\tThe weekly newsletter from science writers takes the jargon out of science and puts the fun in! Data Point\n\t\t\t\t\t\t\t\t\tDecoding the headlines with facts, figures, and numbers Health Matters\n\t\t\t\t\t\t\t\t\tRamya Kannan writes to you on getting to good health, and staying there The Hindu On Books\n\t\t\t\t\t\t\t\t\tBooks of the week, reviews, excerpts, new titles and features. September 12, 2025e-Paper Published - September 12, 2025 11:45 am IST - Kathmandu “Tech played... an almost decisive role,” journalist Pranaya Rana told AFP [File]\n                                          | Photo Credit: REUTERS From sparking protests that toppled the prime minister to giving young people a platform to discuss their country's political future, social media was key to Nepal's extraordinary uprising this week. Fuelled in part by anger over flashy lifestyles flaunted by elites, young anti-corruption demonstrators mainly in their 20s rallied on Monday. The loose grouping, largely viewed as members of \"Gen Z\", flooded the capital Kathmandu to demand an end to a ban on Facebook, YouTube and other popular sites. The rallies ended in chaos and tragedy, with at least 19 protesters killed in a police crackdown on Monday. The apps were restored, but protests widened in anger. On Tuesday, other Nepalis joined the crowds. Parliament was set ablaze, KP Sharma Oli resigned as prime minister, and the army took charge of the streets. Now, many activists are taking to the U.S. group-chat app Discord to talk over their next steps. One server with more than 145,000 members has hosted feverish debate about who could be an interim leader, with many pushing 73-year-old former chief justice Sushila Karki. It is just one example of how social media has driven demands for change. More than half of Nepal's 30 million people are online, according to the World Bank. Days before the protests, many had rushed to VPN services, or virtual private networks, to evade blocks on platforms. Fears of a wider internet shutdown also drove a surge in downloads for Bluetooth messaging app Bitchat, created by tech billionaire Jack Dorsey. \"Tech played... an almost decisive role,\" journalist Pranaya Rana told AFP. \"The whole thing started with young people posting on social media about corruption, and the lavish lives that the children of political leaders were leading.\" Hashtags such as #NepoKids, short for nepotism, compared the designer clothing and luxury holidays shown off in their Instagram posts to the difficulties faced by ordinary Nepalis. One post liked 13,000 times accused politicians' children of \"living like millionaires\", asking: \"Where is the tax money going?\" \"NepoKids was trending all the time,\" including in rural areas where Facebook is popular, said rights activist Sanjib Chaudhary. \"This fuelled the fire\" of anger that \"has been growing for a long time\", he said. Deep dissatisfaction lies behind the social unrest in the Himalayan nation, among young people exasperated with slow economic development and political instability. The government's social media ban \"wasn't trying to suppress\" the NepoKids trend, but the timing meant people \"saw it as an attack on their freedom of speech\", Rana said. A week ago, Nepal said it would block access to 26 social media platforms, from Facebook to X and LinkedIn, for failing to meet a deadline to register in the country. Those that had registered, including TikTok and Viber, remained online. Nepal has restricted access to online platforms in the past, including Telegram in July. Last year, the government lifted a nine-month ban on TikTok after it agreed to comply with Nepali regulations. The government wanted companies to give them the power to \"prohibit broad categories of speech such as 'misinformation' or content deemed to disrupt 'social harmony'\", Felicia Anthonio from the US digital rights group Access Now told AFP. Swiss-based company Proton VPN said Monday that sign-ups from Nepal had shot up 6,000 percent in three days. Interest rose in Dorsey's Bitchat platform, which works offline and describes itself as way to resist censorship. \"There when you need it,\" wrote Dorsey on X, citing a post describing a \"sudden spike\" in Bitchat downloads during the protests in Indonesia and Nepal. Chaudhary said the government \"seriously underestimated the power of social media\". Published - September 12, 2025 11:45 am IST technology (general)\n                    \n                            /                      \n                        \n                        internet\n                    \n                            /                      \n                        \n                        Artificial Intelligence\n                    \n                            /                      \n                        \n                        Nepal\n                    \n                            /                      \n                        \n                        social networking Copyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved. BACK TO TOP Terms & conditions  |  Institutional Subscriber Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines   for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  }
]